; ModuleID = 'C_Standard.apoc'
source_filename = "C_Standard.apoc"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%Printable_Type_Info = type { ptr, ptr }
%__Internal_Context.0 = type { ptr }
%string = type { ptr, i64 }
%String_Builder = type { [256 x i8], i64, ptr }
%Type_Struct = type { i32, i32, i8, i8, ptr, ptr, ptr }
%Any = type { ptr, ptr }
%Type_Primitive = type { i32, i32 }
%Printable_Struct = type { i32, i32 }
%Type_Info = type { i32, i32, i8, i8, ptr, ptr, ptr }

@global_var = constant i64 256, !dbg !0
@global_var.1 = global [1024 x %Printable_Type_Info] zeroinitializer, !dbg !4
@global_var.2 = global i64 0, !dbg !16
@global_var.3 = constant i64 65536, !dbg !18
@global_var.4 = constant i64 131072, !dbg !21
@global_var.5 = constant i64 262144, !dbg !23
@global_var.6 = constant i64 524288, !dbg !25
@global_var.7 = constant i64 1048576, !dbg !27
@global_var.8 = global i64 54321, !dbg !29
@global_var.9 = constant i8 1, !dbg !32
@global_var.10 = constant i8 0, !dbg !36
@global_var.11 = constant ptr null, !dbg !38
@0 = private unnamed_addr constant [14 x i8] c"Unkown struct\00", align 1
@1 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@2 = private unnamed_addr constant [4 x i8] c"%p\0A\00", align 1
@3 = private unnamed_addr constant [4 x i8] c"%d\0A\00", align 1
@4 = private unnamed_addr constant [17 x i8] c"len: %d, text %s\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "STRING_BUFFER_SIZE", scope: !2, file: !2, line: 4, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "./String.apoc", directory: "W:\\ApocCompiler\\bin\\Standard")
!3 = !DIBasicType(name: "i64", size: 64, encoding: DW_ATE_signed)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "printable_types", scope: !2, file: !2, line: 24, type: !6, isLocal: true, isDefinition: true)
!6 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 131072, align: 64, elements: !14)
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "Printable_Type_Info", scope: !2, file: !2, line: 18, size: 128, align: 64, elements: !8)
!8 = !{!9, !11}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !2, file: !2, line: 20, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !2, file: !2, line: 21, baseType: !12, size: 64, align: 64, offset: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!14 = !{!15}
!15 = !DISubrange(count: 1024, lowerBound: 0)
!16 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression())
!17 = distinct !DIGlobalVariable(name: "last_printable_type", scope: !2, file: !2, line: 25, type: !3, isLocal: true, isDefinition: true)
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(name: "DELETE", scope: !20, file: !20, line: 58, type: !3, isLocal: true, isDefinition: true)
!20 = !DIFile(filename: "./Windows.apoc", directory: "W:\\ApocCompiler\\bin\\Standard")
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(name: "READ_CONTROL", scope: !20, file: !20, line: 59, type: !3, isLocal: true, isDefinition: true)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "WRITE_DAC", scope: !20, file: !20, line: 60, type: !3, isLocal: true, isDefinition: true)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "WRITE_OWNER", scope: !20, file: !20, line: 61, type: !3, isLocal: true, isDefinition: true)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "SYNCHRONIZE", scope: !20, file: !20, line: 62, type: !3, isLocal: true, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "my_global_var", scope: !31, file: !31, line: 4, type: !3, isLocal: true, isDefinition: true)
!31 = !DIFile(filename: "./Test.apoc", directory: "W:\\ApocCompiler")
!32 = !DIGlobalVariableExpression(var: !33, expr: !DIExpression())
!33 = distinct !DIGlobalVariable(name: "true", scope: !34, file: !34, line: 5, type: !35, isLocal: true, isDefinition: true)
!34 = !DIFile(filename: "./Basic.apoc", directory: "W:\\ApocCompiler\\bin\\Standard")
!35 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(name: "false", scope: !34, file: !34, line: 6, type: !35, isLocal: true, isDefinition: true)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "null", scope: !34, file: !34, line: 7, type: !10, isLocal: true, isDefinition: true)
!40 = distinct !DICompileUnit(language: DW_LANG_C99, file: !41, producer: "Apoc Compiler", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !42)
!41 = !DIFile(filename: "C_Standard.apoc", directory: "W:\\ApocCompiler\\bin\\Standard")
!42 = !{!0, !4, !16, !18, !21, !23, !25, !27, !29, !32, !36, !38}
!43 = !{i32 2, !"Debug Info Version", i32 3}
!44 = !{i32 2, !"CodeView", i32 1}
!45 = distinct !DISubprogram(name: "mem_alloc", scope: !41, file: !41, line: 12, type: !46, scopeLine: 13, spFlags: DISPFlagDefinition, unit: !40, retainedNodes: !49)
!46 = !DISubroutineType(types: !47)
!47 = !{!10, !48}
!48 = !DIBasicType(name: "u64", size: 32, encoding: DW_ATE_unsigned)
!49 = !{}
!50 = !DILocalVariable(name: "__apoc_internal_context", scope: !45, file: !41, line: 12, type: !51)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "__Internal_Context", scope: !34, file: !34, line: 50, size: 64, align: 64, elements: !52)
!52 = !{!53}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !34, file: !34, line: 51, baseType: !10, size: 64, align: 64)
!54 = !DILocation(line: 12, scope: !45)
!55 = !DILocalVariable(name: "size", arg: 1, scope: !45, file: !41, line: 12, type: !48)
!56 = !DILocation(line: 14, column: 2, scope: !45)
!57 = !DILocalVariable(name: "result", scope: !45, file: !41, line: 14, type: !10, align: 64)
!58 = !DILocation(line: 15, column: 8, scope: !45)
!59 = !DILocation(line: 16, column: 5, scope: !45)
!60 = distinct !DISubprogram(name: "register_printable", scope: !2, file: !2, line: 27, type: !61, scopeLine: 27, spFlags: DISPFlagDefinition, unit: !40, retainedNodes: !49)
!61 = !DISubroutineType(types: !62)
!62 = !{null, !10, !12}
!63 = !DILocalVariable(name: "__apoc_internal_context", scope: !60, file: !2, line: 27, type: !51)
!64 = !DILocation(line: 27, scope: !60)
!65 = !DILocalVariable(name: "print_fn", arg: 1, scope: !60, file: !2, line: 27, type: !10)
!66 = !DILocalVariable(name: "type_name", arg: 2, scope: !60, file: !2, line: 27, type: !12)
!67 = !DILocation(line: 28, column: 2, scope: !60)
!68 = !DILocalVariable(name: "info", scope: !60, file: !2, line: 28, type: !7, align: 64)
!69 = !DILocation(line: 30, column: 2, scope: !60)
!70 = !DILocation(line: 31, column: 1, scope: !60)
!71 = distinct !DISubprogram(name: "builder_to_string", scope: !2, file: !2, line: 33, type: !72, scopeLine: 34, spFlags: DISPFlagDefinition, unit: !40, retainedNodes: !49)
!72 = !DISubroutineType(types: !73)
!73 = !{!74, !78}
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", scope: !2, file: !2, line: 5, size: 128, align: 64, elements: !75)
!75 = !{!76, !77}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !2, file: !2, line: 7, baseType: !12, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !2, file: !2, line: 8, baseType: !3, size: 64, align: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "String_Builder", scope: !2, file: !2, line: 11, size: 2176, align: 64, elements: !80)
!80 = !{!81, !85, !86}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !2, file: !2, line: 13, baseType: !82, size: 2048, align: 8)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 2048, align: 8, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 256, lowerBound: 0)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !2, file: !2, line: 14, baseType: !3, size: 64, align: 64, offset: 2048)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2, file: !2, line: 15, baseType: !78, size: 64, align: 64, offset: 2112)
!87 = !DILocalVariable(name: "__apoc_internal_context", scope: !71, file: !2, line: 33, type: !51)
!88 = !DILocation(line: 33, scope: !71)
!89 = !DILocalVariable(name: "builder", arg: 1, scope: !71, file: !2, line: 33, type: !78)
!90 = !DILocalVariable(name: "out", scope: !71, file: !2, line: 35, type: !74, align: 64)
!91 = !DILocation(line: 35, column: 2, scope: !71)
!92 = !DILocation(line: 36, column: 2, scope: !71)
!93 = !DILocalVariable(name: "out_len", scope: !71, file: !2, line: 36, type: !3, align: 64)
!94 = !DILocation(line: 37, column: 2, scope: !71)
!95 = !DILocalVariable(name: "current", scope: !71, file: !2, line: 37, type: !78, align: 64)
!96 = !DILocation(line: 38, column: 2, scope: !71)
!97 = !DILocalVariable(name: "i", scope: !71, file: !2, line: 38, type: !3, align: 64)
!98 = !DILocation(line: 38, column: 6, scope: !71)
!99 = !DILocation(line: 39, column: 3, scope: !71)
!100 = !DILocation(line: 40, column: 3, scope: !71)
!101 = !DILocation(line: 42, column: 2, scope: !71)
!102 = !DILocation(line: 43, column: 2, scope: !71)
!103 = !DILocation(line: 44, column: 2, scope: !71)
!104 = !DILocation(line: 46, column: 2, scope: !71)
!105 = !DILocalVariable(name: "times", scope: !71, file: !2, line: 46, type: !3, align: 64)
!106 = !DILocation(line: 47, column: 2, scope: !71)
!107 = !DILocalVariable(name: "i", scope: !71, file: !2, line: 47, type: !3, align: 64)
!108 = !DILocation(line: 47, column: 6, scope: !71)
!109 = !DILocation(line: 48, column: 7, scope: !71)
!110 = !DILocation(line: 49, column: 3, scope: !71)
!111 = !DILocation(line: 50, column: 3, scope: !71)
!112 = !DILocation(line: 52, column: 6, scope: !71)
!113 = !DILocation(line: 53, column: 2, scope: !71)
!114 = !DILocation(line: 54, column: 5, scope: !71)
!115 = distinct !DISubprogram(name: "init_builder", scope: !2, file: !2, line: 57, type: !116, scopeLine: 58, spFlags: DISPFlagDefinition, unit: !40, retainedNodes: !49)
!116 = !DISubroutineType(types: !117)
!117 = !{!79, !12}
!118 = !DILocalVariable(name: "__apoc_internal_context", scope: !115, file: !2, line: 57, type: !51)
!119 = !DILocation(line: 57, scope: !115)
!120 = !DILocalVariable(name: "text", arg: 1, scope: !115, file: !2, line: 57, type: !12)
!121 = !DILocalVariable(name: "out", scope: !115, file: !2, line: 59, type: !79, align: 64)
!122 = !DILocation(line: 59, column: 2, scope: !115)
!123 = !DILocation(line: 60, column: 2, scope: !115)
!124 = !DILocalVariable(name: "current", scope: !115, file: !2, line: 60, type: !78, align: 64)
!125 = !DILocation(line: 61, column: 2, scope: !115)
!126 = !DILocalVariable(name: "times", scope: !115, file: !2, line: 61, type: !3, align: 64)
!127 = !DILocation(line: 62, column: 2, scope: !115)
!128 = !DILocalVariable(name: "i", scope: !115, file: !2, line: 62, type: !3, align: 64)
!129 = !DILocation(line: 62, column: 6, scope: !115)
!130 = !DILocation(line: 63, column: 3, scope: !115)
!131 = !DILocation(line: 64, column: 3, scope: !115)
!132 = !DILocation(line: 65, column: 3, scope: !115)
!133 = !DILocation(line: 69, column: 4, scope: !115)
!134 = !DILocation(line: 72, column: 5, scope: !115)
!135 = !DILocation(line: 66, column: 4, scope: !115)
!136 = !DILocation(line: 67, column: 4, scope: !115)
!137 = !DILocation(line: 68, column: 4, scope: !115)
!138 = distinct !DISubprogram(name: "compare", scope: !2, file: !2, line: 127, type: !139, scopeLine: 128, spFlags: DISPFlagDefinition, unit: !40, retainedNodes: !49)
!139 = !DISubroutineType(types: !140)
!140 = !{!35, !141, !141}
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!142 = !DILocalVariable(name: "__apoc_internal_context", scope: !138, file: !2, line: 127, type: !51)
!143 = !DILocation(line: 127, scope: !138)
!144 = !DILocalVariable(name: "str1", arg: 1, scope: !138, file: !2, line: 127, type: !141)
!145 = !DILocalVariable(name: "str2", arg: 2, scope: !138, file: !2, line: 127, type: !141)
!146 = !DILocation(line: 129, column: 2, scope: !138)
!147 = !DILocation(line: 132, column: 2, scope: !138)
!148 = !DILocation(line: 130, column: 6, scope: !138)
!149 = !DILocalVariable(name: "i", scope: !138, file: !2, line: 132, type: !3, align: 64)
!150 = !DILocation(line: 132, column: 6, scope: !138)
!151 = !DILocation(line: 133, column: 3, scope: !138)
!152 = !DILocation(line: 133, column: 38, scope: !138)
!153 = !DILocation(line: 134, column: 5, scope: !138)
!154 = distinct !DISubprogram(name: "to_string", scope: !2, file: !2, line: 137, type: !155, scopeLine: 138, spFlags: DISPFlagDefinition, unit: !40, retainedNodes: !49)
!155 = !DISubroutineType(types: !156)
!156 = !{!74, !12}
!157 = !DILocalVariable(name: "__apoc_internal_context", scope: !154, file: !2, line: 137, type: !51)
!158 = !DILocation(line: 137, scope: !154)
!159 = !DILocalVariable(name: "text", arg: 1, scope: !154, file: !2, line: 137, type: !12)
!160 = !DILocation(line: 139, column: 2, scope: !154)
!161 = !DILocalVariable(name: "text_len", scope: !154, file: !2, line: 139, type: !3, align: 64)
!162 = !DILocation(line: 140, column: 2, scope: !154)
!163 = !DILocalVariable(name: "allocated", scope: !154, file: !2, line: 140, type: !10, align: 64)
!164 = !DILocation(line: 141, column: 6, scope: !154)
!165 = !DILocation(line: 142, column: 2, scope: !154)
!166 = !DILocalVariable(name: "str", scope: !154, file: !2, line: 142, type: !74, align: 64)
!167 = !DILocation(line: 143, column: 5, scope: !154)
!168 = distinct !DISubprogram(name: "terminate_string", scope: !2, file: !2, line: 146, type: !169, scopeLine: 147, spFlags: DISPFlagDefinition, unit: !40, retainedNodes: !49)
!169 = !DISubroutineType(types: !170)
!170 = !{!74, !74}
!171 = !DILocalVariable(name: "__apoc_internal_context", scope: !168, file: !2, line: 146, type: !51)
!172 = !DILocation(line: 146, scope: !168)
!173 = !DILocalVariable(name: "str", arg: 1, scope: !168, file: !2, line: 146, type: !74)
!174 = !DILocation(line: 148, column: 2, scope: !168)
!175 = !DILocalVariable(scope: !168, file: !2, line: 148, type: !74, align: 64)
!176 = !DILocation(line: 149, column: 2, scope: !168)
!177 = !DILocation(line: 150, column: 2, scope: !168)
!178 = !DILocation(line: 151, column: 6, scope: !168)
!179 = !DILocation(line: 152, column: 2, scope: !168)
!180 = !DILocation(line: 153, column: 5, scope: !168)
!181 = distinct !DISubprogram(name: "build_unsigned_int", scope: !2, file: !2, line: 156, type: !182, scopeLine: 156, spFlags: DISPFlagDefinition, unit: !40, retainedNodes: !49)
!182 = !DISubroutineType(types: !183)
!183 = !{null, !48, !3, !78}
!184 = !DILocalVariable(name: "__apoc_internal_context", scope: !181, file: !2, line: 156, type: !51)
!185 = !DILocation(line: 156, scope: !181)
!186 = !DILocalVariable(name: "num", arg: 1, scope: !181, file: !2, line: 156, type: !48)
!187 = !DILocalVariable(name: "num_size", arg: 2, scope: !181, file: !2, line: 156, type: !3)
!188 = !DILocalVariable(name: "builder", arg: 3, scope: !181, file: !2, line: 156, type: !78)
!189 = !DILocation(line: 157, column: 2, scope: !181)
!190 = !DILocation(line: 162, column: 1, scope: !181)
!191 = !DILocation(line: 158, column: 3, scope: !181)
!192 = !DILocalVariable(name: "digit", scope: !181, file: !2, line: 158, type: !48, align: 64)
!193 = !DILocation(line: 159, column: 21, scope: !181)
!194 = !DILocation(line: 3056016024, scope: !181)
!195 = distinct !DISubprogram(name: "int_to_str", scope: !2, file: !2, line: 164, type: !196, scopeLine: 165, spFlags: DISPFlagDefinition, unit: !40, retainedNodes: !49)
!196 = !DISubroutineType(types: !197)
!197 = !{null, !3, !78}
!198 = !DILocalVariable(name: "__apoc_internal_context", scope: !195, file: !2, line: 164, type: !51)
!199 = !DILocation(line: 164, scope: !195)
!200 = !DILocalVariable(name: "num", arg: 1, scope: !195, file: !2, line: 164, type: !3)
!201 = !DILocalVariable(name: "builder", arg: 2, scope: !195, file: !2, line: 164, type: !78)
!202 = !DILocation(line: 166, column: 2, scope: !195)
!203 = !DILocation(line: 173, column: 2, scope: !195)
!204 = !DILocation(line: 3056016024, scope: !195)
!205 = !DILocation(line: 168, column: 5, scope: !195)
!206 = !DILocation(line: 170, column: 2, scope: !195)
!207 = !DILocalVariable(name: "div_copy", scope: !195, file: !2, line: 170, type: !3, align: 64)
!208 = !DILocation(line: 171, column: 2, scope: !195)
!209 = !DILocalVariable(name: "num_size", scope: !195, file: !2, line: 171, type: !3, align: 64)
!210 = !DILocation(line: 174, column: 3, scope: !195)
!211 = !DILocation(line: 176, column: 2, scope: !195)
!212 = !DILocation(line: 182, column: 1, scope: !195)
!213 = !DILocation(line: 178, column: 3, scope: !195)
!214 = !DILocation(line: 179, column: 3, scope: !195)
!215 = !DILocation(line: 181, column: 20, scope: !195)
!216 = distinct !DISubprogram(name: "float_to_str", scope: !2, file: !2, line: 184, type: !217, scopeLine: 185, spFlags: DISPFlagDefinition, unit: !40, retainedNodes: !49)
!217 = !DISubroutineType(types: !218)
!218 = !{null, !219, !78}
!219 = !DIBasicType(name: "f64", size: 64, encoding: DW_ATE_float)
!220 = !DILocalVariable(name: "__apoc_internal_context", scope: !216, file: !2, line: 184, type: !51)
!221 = !DILocation(line: 184, scope: !216)
!222 = !DILocalVariable(name: "num", arg: 1, scope: !216, file: !2, line: 184, type: !219)
!223 = !DILocalVariable(name: "builder", arg: 2, scope: !216, file: !2, line: 184, type: !78)
!224 = !DILocation(line: 186, column: 2, scope: !216)
!225 = !DILocation(line: 201, column: 2, scope: !216)
!226 = !DILocation(line: 3056016024, scope: !216)
!227 = !DILocation(line: 188, column: 3, scope: !216)
!228 = !DILocation(line: 191, column: 2, scope: !216)
!229 = !DILocalVariable(name: "decimal", scope: !216, file: !2, line: 191, type: !48, align: 64)
!230 = !DILocation(line: 192, column: 2, scope: !216)
!231 = !DILocation(line: 194, column: 2, scope: !216)
!232 = !DILocation(line: 199, column: 2, scope: !216)
!233 = !DILocalVariable(name: "zeroes_to_append", scope: !216, file: !2, line: 199, type: !3, align: 64)
!234 = !DILocation(line: 197, column: 17, scope: !216)
!235 = !DILocation(line: 202, column: 3, scope: !216)
!236 = !DILocation(line: 203, column: 3, scope: !216)
!237 = !DILocation(line: 203, column: 20, scope: !216)
!238 = !DILocation(line: 206, column: 2, scope: !216)
!239 = !DILocalVariable(name: "i", scope: !216, file: !2, line: 206, type: !3, align: 64)
!240 = !DILocation(line: 206, column: 6, scope: !216)
!241 = !DILocation(line: 210, column: 12, scope: !216)
!242 = !DILocation(line: 211, column: 1, scope: !216)
!243 = distinct !DISubprogram(name: "find_printable_type", scope: !2, file: !2, line: 213, type: !244, scopeLine: 214, spFlags: DISPFlagDefinition, unit: !40, retainedNodes: !49)
!244 = !DISubroutineType(types: !245)
!245 = !{null, !246, !78}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: "Any", scope: !34, file: !34, line: 54, size: 128, align: 64, elements: !248)
!248 = !{!249, !305}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !34, file: !34, line: 55, baseType: !250, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Info", scope: !34, file: !34, line: 59, size: 320, align: 64, elements: !252)
!252 = !{!253, !255, !260, !273, !281, !288, !296}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !34, file: !34, line: 60, baseType: !254, size: 32, align: 32)
!254 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "primitive", scope: !34, file: !34, line: 69, baseType: !256, size: 64, align: 32)
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Primitive", scope: !34, file: !34, line: 69, size: 64, align: 32, elements: !257)
!257 = !{!258, !259}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !34, file: !34, line: 70, baseType: !254, size: 32, align: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !34, file: !34, line: 71, baseType: !254, size: 32, align: 32, offset: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !34, file: !34, line: 74, baseType: !261, size: 320, align: 64)
!261 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Struct", scope: !34, file: !34, line: 74, size: 320, align: 64, elements: !262)
!262 = !{!263, !264, !265, !266, !267, !268, !270}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !34, file: !34, line: 75, baseType: !254, size: 32, align: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "member_count", scope: !34, file: !34, line: 76, baseType: !254, size: 32, align: 32, offset: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "is_union", scope: !34, file: !34, line: 77, baseType: !35, size: 8, align: 8, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "is_packed", scope: !34, file: !34, line: 78, baseType: !35, size: 8, align: 8, offset: 72)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !34, file: !34, line: 79, baseType: !12, size: 64, align: 64, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "member_names", scope: !34, file: !34, line: 80, baseType: !269, size: 64, align: 64, offset: 192)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "member_types", scope: !34, file: !34, line: 81, baseType: !271, size: 64, align: 64, offset: 256)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Info", scope: !34, file: !34, line: 81, size: 320, align: 64, elements: !252)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !34, file: !34, line: 84, baseType: !274, size: 192, align: 64)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Array", scope: !34, file: !34, line: 84, size: 192, align: 64, elements: !275)
!275 = !{!276, !277, !280}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !34, file: !34, line: 85, baseType: !254, size: 32, align: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !34, file: !34, line: 86, baseType: !278, size: 64, align: 64, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Info", scope: !34, file: !34, line: 86, size: 320, align: 64, elements: !252)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "elem_count", scope: !34, file: !34, line: 87, baseType: !48, size: 64, align: 64, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !34, file: !34, line: 90, baseType: !282, size: 128, align: 64)
!282 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Pointer", scope: !34, file: !34, line: 90, size: 128, align: 64, elements: !283)
!283 = !{!284, !285}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !34, file: !34, line: 91, baseType: !254, size: 32, align: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "pointed", scope: !34, file: !34, line: 92, baseType: !286, size: 64, align: 64, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Info", scope: !34, file: !34, line: 92, size: 320, align: 64, elements: !252)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "enumerator", scope: !34, file: !34, line: 95, baseType: !289, size: 256, align: 64)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Enum", scope: !34, file: !34, line: 95, size: 256, align: 64, elements: !290)
!290 = !{!291, !292, !293, !294}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !34, file: !34, line: 96, baseType: !254, size: 32, align: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !34, file: !34, line: 97, baseType: !256, size: 64, align: 32, offset: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "names", scope: !34, file: !34, line: 98, baseType: !269, size: 64, align: 64, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !34, file: !34, line: 99, baseType: !295, size: 64, align: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !34, file: !34, line: 102, baseType: !297, size: 256, align: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Func", scope: !34, file: !34, line: 102, size: 256, align: 64, elements: !298)
!298 = !{!299, !300, !303, !304}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !34, file: !34, line: 103, baseType: !254, size: 32, align: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "param_types", scope: !34, file: !34, line: 104, baseType: !301, size: 64, align: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Info", scope: !34, file: !34, line: 104, size: 320, align: 64, elements: !252)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "return_type", scope: !34, file: !34, line: 105, baseType: !301, size: 64, align: 64, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "calling_convention", scope: !34, file: !34, line: 106, baseType: !254, size: 32, align: 32, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !34, file: !34, line: 56, baseType: !10, size: 64, align: 64, offset: 64)
!306 = !DILocalVariable(name: "__apoc_internal_context", scope: !243, file: !2, line: 213, type: !51)
!307 = !DILocation(line: 213, scope: !243)
!308 = !DILocalVariable(name: "item", arg: 1, scope: !243, file: !2, line: 213, type: !246)
!309 = !DILocalVariable(name: "builder", arg: 2, scope: !243, file: !2, line: 213, type: !78)
!310 = !DILocation(line: 215, column: 2, scope: !243)
!311 = !DILocalVariable(name: "i", scope: !243, file: !2, line: 215, type: !3, align: 64)
!312 = !DILocation(line: 215, column: 6, scope: !243)
!313 = !DILocation(line: 216, column: 3, scope: !243)
!314 = !DILocation(line: 218, column: 6, scope: !243)
!315 = !DILocation(line: 3056015808, scope: !243)
!316 = !DILocation(line: 222, column: 4, scope: !243)
!317 = distinct !DISubprogram(name: "parse_format", scope: !2, file: !2, line: 225, type: !318, scopeLine: 226, spFlags: DISPFlagDefinition, unit: !40, retainedNodes: !49)
!318 = !DISubroutineType(types: !319)
!319 = !{!74, !74, !246}
!320 = !DILocalVariable(name: "__apoc_internal_context", scope: !317, file: !2, line: 225, type: !51)
!321 = !DILocation(line: 225, scope: !317)
!322 = !DILocalVariable(name: "format", arg: 1, scope: !317, file: !2, line: 225, type: !74)
!323 = !DILocalVariable(name: "list", arg: 2, scope: !317, file: !2, line: 225, type: !246)
!324 = !DILocation(line: 227, column: 2, scope: !317)
!325 = !DILocalVariable(name: "builder", scope: !317, file: !2, line: 227, type: !79, align: 64)
!326 = !DILocation(line: 228, column: 2, scope: !317)
!327 = !DILocalVariable(name: "list_index", scope: !317, file: !2, line: 228, type: !3, align: 64)
!328 = !DILocation(line: 229, column: 8, scope: !317)
!329 = !DILocation(line: 230, column: 8, scope: !317)
!330 = !DILocation(line: 231, column: 2, scope: !317)
!331 = !DILocalVariable(name: "i", scope: !317, file: !2, line: 231, type: !3, align: 64)
!332 = !DILocation(line: 231, column: 6, scope: !317)
!333 = !DILocation(line: 232, column: 3, scope: !317)
!334 = !DILocation(line: 3056016024, scope: !317)
!335 = !DILocation(line: 267, column: 2, scope: !317)
!336 = !DILocalVariable(name: "out", scope: !317, file: !2, line: 267, type: !74, align: 64)
!337 = !DILocation(line: 268, column: 5, scope: !317)
!338 = !DILocation(line: 233, column: 4, scope: !317)
!339 = !DILocalVariable(name: "item", scope: !317, file: !2, line: 233, type: !247, align: 64)
!340 = !DILocation(line: 234, column: 4, scope: !317)
!341 = !DILocation(line: 235, column: 4, scope: !317)
!342 = !DILocalVariable(name: "type", scope: !317, file: !2, line: 235, type: !254, align: 32)
!343 = !DILocation(line: 236, column: 4, scope: !317)
!344 = !DILocation(line: 237, column: 5, scope: !317)
!345 = !DILocalVariable(name: "to_parse", scope: !317, file: !2, line: 237, type: !3, align: 64)
!346 = !DILocation(line: 238, column: 5, scope: !317)
!347 = !DILocalVariable(name: "size", scope: !317, file: !2, line: 238, type: !254, align: 32)
!348 = !DILocation(line: 239, column: 5, scope: !317)
!349 = !DILocation(line: 247, column: 15, scope: !317)
!350 = !DILocation(line: 240, column: 6, scope: !317)
!351 = !DILocation(line: 241, column: 10, scope: !317)
!352 = !DILocation(line: 246, column: 6, scope: !317)
!353 = !DILocation(line: 242, column: 6, scope: !317)
!354 = !DILocation(line: 243, column: 10, scope: !317)
!355 = !DILocation(line: 244, column: 6, scope: !317)
!356 = !DILocation(line: 248, column: 11, scope: !317)
!357 = !DILocation(line: 249, column: 5, scope: !317)
!358 = !DILocalVariable(name: "to_parse", scope: !317, file: !2, line: 249, type: !219, align: 64)
!359 = !DILocation(line: 250, column: 5, scope: !317)
!360 = !DILocalVariable(name: "size", scope: !317, file: !2, line: 250, type: !254, align: 32)
!361 = !DILocation(line: 251, column: 5, scope: !317)
!362 = !DILocation(line: 256, column: 17, scope: !317)
!363 = !DILocation(line: 252, column: 6, scope: !317)
!364 = !DILocation(line: 254, column: 6, scope: !317)
!365 = !DILocation(line: 257, column: 11, scope: !317)
!366 = !DILocation(line: 258, column: 24, scope: !317)
!367 = distinct !DISubprogram(name: "format_args!@string!@-", scope: !2, file: !2, line: 281, type: !169, scopeLine: 282, spFlags: DISPFlagDefinition, unit: !40, retainedNodes: !49)
!368 = !DILocalVariable(name: "__apoc_internal_context", scope: !369, file: !2, line: 271, type: !51)
!369 = distinct !DISubprogram(name: "format_args", scope: !2, file: !2, line: 271, type: !155, scopeLine: 272, spFlags: DISPFlagDefinition, unit: !40, retainedNodes: !49)
!370 = !DILocation(line: 271, scope: !369)
!371 = !DILocalVariable(name: "format", arg: 1, scope: !369, file: !2, line: 271, type: !12)
!372 = !DILocation(line: 273, column: 2, scope: !369)
!373 = !DILocalVariable(name: "str", scope: !369, file: !2, line: 273, type: !74, align: 64)
!374 = !DILocation(line: 274, column: 2, scope: !369)
!375 = !DILocalVariable(scope: !369, file: !2, line: 274, type: !246, align: 64)
!376 = !DILocation(line: 275, column: 15, scope: !369)
!377 = !DILocation(line: 276, column: 2, scope: !369)
!378 = !DILocalVariable(name: "out", scope: !369, file: !2, line: 276, type: !74, align: 64)
!379 = !DILocation(line: 277, column: 14, scope: !369)
!380 = !DILocation(line: 278, column: 5, scope: !369)
!381 = distinct !DISubprogram(name: "print!@string!@-", scope: !2, file: !2, line: 302, type: !382, scopeLine: 303, spFlags: DISPFlagDefinition, unit: !40, retainedNodes: !49)
!382 = !DISubroutineType(types: !383)
!383 = !{null, !74}
!384 = !DILocalVariable(name: "__apoc_internal_context", scope: !385, file: !2, line: 290, type: !51)
!385 = distinct !DISubprogram(name: "print", scope: !2, file: !2, line: 290, type: !386, scopeLine: 291, spFlags: DISPFlagDefinition, unit: !40, retainedNodes: !49)
!386 = !DISubroutineType(types: !387)
!387 = !{null, !12}
!388 = !DILocation(line: 290, scope: !385)
!389 = !DILocalVariable(name: "format", arg: 1, scope: !385, file: !2, line: 290, type: !12)
!390 = !DILocation(line: 292, column: 2, scope: !385)
!391 = !DILocalVariable(name: "str", scope: !385, file: !2, line: 292, type: !74, align: 64)
!392 = !DILocation(line: 293, column: 8, scope: !385)
!393 = !DILocation(line: 294, column: 2, scope: !385)
!394 = !DILocalVariable(scope: !385, file: !2, line: 294, type: !246, align: 64)
!395 = !DILocation(line: 295, column: 15, scope: !385)
!396 = !DILocation(line: 296, column: 2, scope: !385)
!397 = !DILocalVariable(name: "out", scope: !385, file: !2, line: 296, type: !74, align: 64)
!398 = !DILocation(line: 297, column: 14, scope: !385)
!399 = !DILocation(line: 298, column: 2, scope: !385)
!400 = !DILocalVariable(name: "stdout", scope: !385, file: !2, line: 298, type: !10, align: 64)
!401 = !DILocation(line: 299, column: 12, scope: !385)
!402 = !DILocation(line: 300, column: 1, scope: !385)
!403 = distinct !DISubprogram(name: "copy", scope: !2, file: !2, line: 313, type: !404, scopeLine: 314, spFlags: DISPFlagDefinition, unit: !40, retainedNodes: !49)
!404 = !DISubroutineType(types: !405)
!405 = !{null, !10, !10, !48}
!406 = !DILocalVariable(name: "__apoc_internal_context", scope: !403, file: !2, line: 313, type: !51)
!407 = !DILocation(line: 313, scope: !403)
!408 = !DILocalVariable(name: "dst", arg: 1, scope: !403, file: !2, line: 313, type: !10)
!409 = !DILocalVariable(name: "src", arg: 2, scope: !403, file: !2, line: 313, type: !10)
!410 = !DILocalVariable(name: "size", arg: 3, scope: !403, file: !2, line: 313, type: !48)
!411 = !DILocation(line: 315, column: 2, scope: !403)
!412 = !DILocalVariable(name: "a0", scope: !403, file: !2, line: 315, type: !12, align: 64)
!413 = !DILocation(line: 316, column: 2, scope: !403)
!414 = !DILocalVariable(name: "a1", scope: !403, file: !2, line: 316, type: !12, align: 64)
!415 = !DILocation(line: 317, column: 2, scope: !403)
!416 = !DILocalVariable(name: "i", scope: !403, file: !2, line: 317, type: !3, align: 64)
!417 = !DILocation(line: 317, column: 6, scope: !403)
!418 = !DILocation(line: 319, column: 3, scope: !403)
!419 = !DILocation(line: 321, column: 1, scope: !403)
!420 = distinct !DISubprogram(name: "len", scope: !2, file: !2, line: 323, type: !421, scopeLine: 324, spFlags: DISPFlagDefinition, unit: !40, retainedNodes: !49)
!421 = !DISubroutineType(types: !422)
!422 = !{!3, !12}
!423 = !DILocalVariable(name: "__apoc_internal_context", scope: !420, file: !2, line: 323, type: !51)
!424 = !DILocation(line: 323, scope: !420)
!425 = !DILocalVariable(name: "text", arg: 1, scope: !420, file: !2, line: 323, type: !12)
!426 = !DILocation(line: 325, column: 2, scope: !420)
!427 = !DILocalVariable(name: "result", scope: !420, file: !2, line: 325, type: !3, align: 64)
!428 = !DILocation(line: 326, column: 2, scope: !420)
!429 = !DILocation(line: 327, column: 5, scope: !420)
!430 = distinct !DISubprogram(name: "open_file", scope: !20, file: !20, line: 26, type: !431, scopeLine: 27, spFlags: DISPFlagDefinition, unit: !40, retainedNodes: !49)
!431 = !DISubroutineType(types: !432)
!432 = !{!10, !12, !3}
!433 = !DILocalVariable(name: "__apoc_internal_context", scope: !430, file: !20, line: 26, type: !51)
!434 = !DILocation(line: 26, scope: !430)
!435 = !DILocalVariable(name: "f_name", arg: 1, scope: !430, file: !20, line: 26, type: !12)
!436 = !DILocalVariable(name: "access", arg: 2, scope: !430, file: !20, line: 26, type: !3)
!437 = !DILocation(line: 28, column: 2, scope: !430)
!438 = !DILocalVariable(scope: !430, file: !20, line: 28, type: !3, align: 64)
!439 = !DILocation(line: 29, column: 2, scope: !430)
!440 = !DILocation(line: 35, column: 5, scope: !430)
!441 = !DILocation(line: 29, column: 41, scope: !430)
!442 = !DILocation(line: 30, column: 2, scope: !430)
!443 = !DILocation(line: 30, column: 41, scope: !430)
!444 = !DILocation(line: 31, column: 2, scope: !430)
!445 = !DILocation(line: 31, column: 41, scope: !430)
!446 = !DILocation(line: 32, column: 2, scope: !430)
!447 = !DILocalVariable(name: "file", scope: !430, file: !20, line: 32, type: !10, align: 64)
!448 = distinct !DISubprogram(name: "write_file", scope: !20, file: !20, line: 38, type: !449, scopeLine: 39, spFlags: DISPFlagDefinition, unit: !40, retainedNodes: !49)
!449 = !DISubroutineType(types: !450)
!450 = !{!35, !10, !10, !451}
!451 = !DIBasicType(name: "u32", size: 24, encoding: DW_ATE_unsigned)
!452 = !DILocalVariable(name: "__apoc_internal_context", scope: !448, file: !20, line: 38, type: !51)
!453 = !DILocation(line: 38, scope: !448)
!454 = !DILocalVariable(name: "file", arg: 1, scope: !448, file: !20, line: 38, type: !10)
!455 = !DILocalVariable(name: "data", arg: 2, scope: !448, file: !20, line: 38, type: !10)
!456 = !DILocalVariable(name: "size", arg: 3, scope: !448, file: !20, line: 38, type: !451)
!457 = !DILocation(line: 40, column: 2, scope: !448)
!458 = !DILocalVariable(scope: !448, file: !20, line: 40, type: !451, align: 32)
!459 = !DILocation(line: 41, column: 11, scope: !448)
!460 = !DILocation(line: 42, column: 2, scope: !448)
!461 = !DILocalVariable(name: "result", scope: !448, file: !20, line: 42, type: !35, align: 8)
!462 = !DILocation(line: 43, column: 5, scope: !448)
!463 = distinct !DISubprogram(name: "get_stdout", scope: !20, file: !20, line: 46, type: !464, scopeLine: 47, spFlags: DISPFlagDefinition, unit: !40, retainedNodes: !49)
!464 = !DISubroutineType(types: !465)
!465 = !{!10}
!466 = !DILocalVariable(name: "__apoc_internal_context", scope: !463, file: !20, line: 46, type: !51)
!467 = !DILocation(line: 46, scope: !463)
!468 = !DILocation(line: 48, column: 5, scope: !463)
!469 = distinct !DISubprogram(name: "main", scope: !31, file: !31, line: 6, type: !470, scopeLine: 7, spFlags: DISPFlagDefinition, unit: !40, retainedNodes: !49)
!470 = !DISubroutineType(types: !471)
!471 = !{!254}
!472 = !DILocation(line: 8, column: 2, scope: !469)
!473 = !DILocalVariable(name: "to_print", scope: !469, file: !31, line: 8, type: !474, align: 32)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "Printable_Struct", scope: !31, file: !31, line: 19, size: 64, align: 32, elements: !475)
!475 = !{!476, !477}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "num1", scope: !31, file: !31, line: 20, baseType: !254, size: 32, align: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "num2", scope: !31, file: !31, line: 21, baseType: !254, size: 32, align: 32, offset: 32)
!478 = !DILocation(line: 9, column: 20, scope: !469)
!479 = !DILocation(line: 10, column: 7, scope: !469)
!480 = !DILocation(line: 11, column: 5, scope: !469)
!481 = distinct !DISubprogram(name: "print_printable_struct", scope: !31, file: !31, line: 14, type: !482, scopeLine: 14, spFlags: DISPFlagDefinition, unit: !40, retainedNodes: !49)
!482 = !DISubroutineType(types: !483)
!483 = !{!74, !10}
!484 = !DILocalVariable(name: "__apoc_internal_context", scope: !481, file: !31, line: 14, type: !51)
!485 = !DILocation(line: 14, scope: !481)
!486 = !DILocalVariable(name: "the_struct", arg: 1, scope: !481, file: !31, line: 14, type: !10)
!487 = !DILocation(line: 15, column: 2, scope: !481)
!488 = !DILocalVariable(name: "casted", scope: !481, file: !31, line: 15, type: !489, align: 64)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!490 = !DILocation(line: 16, column: 5, scope: !481)
!491 = distinct !DISubprogram(name: "overload[]", scope: !2, file: !2, line: 75, type: !492, scopeLine: 76, spFlags: DISPFlagDefinition, unit: !40, retainedNodes: !49)
!492 = !DISubroutineType(types: !493)
!493 = !{!13, !74, !3}
!494 = !DILocalVariable(name: "str", scope: !491, file: !2, line: 75, type: !74)
!495 = !DILocation(line: 75, scope: !491)
!496 = !DILocalVariable(name: "index", arg: 1, scope: !491, file: !2, line: 75, type: !3)
!497 = !DILocation(line: 77, column: 5, scope: !491)
!498 = distinct !DISubprogram(name: "overload+", scope: !2, file: !2, line: 80, type: !499, scopeLine: 81, spFlags: DISPFlagDefinition, unit: !40, retainedNodes: !49)
!499 = !DISubroutineType(types: !500)
!500 = !{!74, !74, !12}
!501 = !DILocalVariable(name: "__apoc_internal_context", scope: !498, file: !2, line: 80, type: !51)
!502 = !DILocation(line: 80, scope: !498)
!503 = !DILocalVariable(name: "str", arg: 1, scope: !498, file: !2, line: 80, type: !74)
!504 = !DILocalVariable(name: "text", arg: 2, scope: !498, file: !2, line: 80, type: !12)
!505 = !DILocation(line: 82, column: 2, scope: !498)
!506 = !DILocalVariable(scope: !498, file: !2, line: 82, type: !74, align: 64)
!507 = !DILocation(line: 83, column: 2, scope: !498)
!508 = !DILocalVariable(name: "text_len", scope: !498, file: !2, line: 83, type: !3, align: 64)
!509 = !DILocation(line: 84, column: 2, scope: !498)
!510 = !DILocation(line: 85, column: 2, scope: !498)
!511 = !DILocation(line: 86, column: 6, scope: !498)
!512 = !DILocation(line: 87, column: 6, scope: !498)
!513 = !DILocation(line: 88, column: 5, scope: !498)
!514 = distinct !DISubprogram(name: "overload[x]=", scope: !2, file: !2, line: 91, type: !515, scopeLine: 92, spFlags: DISPFlagDefinition, unit: !40, retainedNodes: !49)
!515 = !DISubroutineType(types: !516)
!516 = !{null, !78, !12}
!517 = !DILocalVariable(name: "str", scope: !514, file: !2, line: 91, type: !78)
!518 = !DILocation(line: 91, scope: !514)
!519 = !DILocalVariable(name: "text", arg: 1, scope: !514, file: !2, line: 91, type: !12)
!520 = !DILocation(line: 93, column: 2, scope: !514)
!521 = !DILocalVariable(name: "text_len", scope: !514, file: !2, line: 93, type: !3, align: 64)
!522 = !DILocation(line: 94, column: 2, scope: !514)
!523 = !DILocalVariable(name: "times", scope: !514, file: !2, line: 94, type: !3, align: 64)
!524 = !DILocation(line: 95, column: 2, scope: !514)
!525 = !DILocalVariable(name: "current", scope: !514, file: !2, line: 95, type: !78, align: 64)
!526 = !DILocation(line: 96, column: 2, scope: !514)
!527 = !DILocalVariable(name: "i", scope: !514, file: !2, line: 96, type: !3, align: 64)
!528 = !DILocation(line: 96, column: 6, scope: !514)
!529 = !DILocation(line: 97, column: 3, scope: !514)
!530 = !DILocalVariable(name: "copy_size", scope: !514, file: !2, line: 97, type: !3, align: 64)
!531 = !DILocation(line: 98, column: 3, scope: !514)
!532 = !DILocation(line: 102, column: 3, scope: !514)
