; ModuleID = 'Test.apoc'
source_filename = "Test.apoc"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%Any = type { ptr, ptr }
%Type_Info = type { %Type_Struct.1 }
%Type_Struct.1 = type { i32, i32, i8, i8, ptr, ptr, ptr }
%__Internal_Context = type { ptr }
%string = type { ptr, i64 }
%String_Builder = type { [256 x i8], i64, ptr }
%Type_Primitive.2 = type { i32, i32 }

@global_var = constant i64 256, !dbg !0
@global_var.1 = constant i64 65536, !dbg !4
@global_var.2 = constant i64 131072, !dbg !7
@global_var.3 = constant i64 262144, !dbg !9
@global_var.4 = constant i64 524288, !dbg !11
@global_var.5 = constant i64 1048576, !dbg !13
@global_var.6 = constant i8 1, !dbg !15
@global_var.7 = constant i8 0, !dbg !19
@global_var.8 = constant ptr null, !dbg !21
@0 = private unnamed_addr constant [14 x i8] c"my big string\00", align 1
@1 = private unnamed_addr constant [13 x i8] c" more text %\00", align 1
@2 = private unnamed_addr constant [10 x i8] c"Number: %\00", align 1
@3 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@4 = private unnamed_addr constant [9 x i8] c"int: %f\0A\00", align 1

declare void @var_arg_start(ptr, ptr)

declare void @var_arg_stop(ptr, ptr)

define i32 @main(ptr %__apoc_internal_context) !dbg !29 {
entry:
  %to_any9 = alloca %Any, align 8
  %any_val8 = alloca i64, align 8
  %runtime_type_info7 = alloca %Type_Info, align 16

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "STRING_BUFFER_SIZE", scope: !2, file: !2, line: 2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "./String.apoc", directory: "E:\\C_Projects\\Apocalypse\\Standard")
!3 = !DIBasicType(name: "i64", size: 64, encoding: DW_ATE_signed)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "DELETE", scope: !6, file: !6, line: 58, type: !3, isLocal: true, isDefinition: true)
!6 = !DIFile(filename: "./Windows.apoc", directory: "E:\\C_Projects\\Apocalypse\\Standard")
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(name: "READ_CONTROL", scope: !6, file: !6, line: 59, type: !3, isLocal: true, isDefinition: true)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "WRITE_DAC", scope: !6, file: !6, line: 60, type: !3, isLocal: true, isDefinition: true)
!11 = !DIGlobalVariableExpression(var: !12, expr: !DIExpression())
!12 = distinct !DIGlobalVariable(name: "WRITE_OWNER", scope: !6, file: !6, line: 61, type: !3, isLocal: true, isDefinition: true)
!13 = !DIGlobalVariableExpression(var: !14, expr: !DIExpression())
!14 = distinct !DIGlobalVariable(name: "SYNCHRONIZE", scope: !6, file: !6, line: 62, type: !3, isLocal: true, isDefinition: true)
!15 = !DIGlobalVariableExpression(var: !16, expr: !DIExpression())
!16 = distinct !DIGlobalVariable(name: "true", scope: !17, file: !17, line: 2, type: !18, isLocal: true, isDefinition: true)
!17 = !DIFile(filename: "./Basic.apoc", directory: "E:\\C_Projects\\Apocalypse\\Standard")
!18 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(name: "false", scope: !17, file: !17, line: 3, type: !18, isLocal: true, isDefinition: true)
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(name: "null", scope: !17, file: !17, line: 4, type: !23, isLocal: true, isDefinition: true)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!24 = distinct !DICompileUnit(language: DW_LANG_C99, file: !25, producer: "Apoc Compiler", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !26)
!25 = !DIFile(filename: "Test.apoc", directory: "E:\\C_Projects\\Apocalypse")
!26 = !{!0, !4, !7, !9, !11, !13, !15, !19, !21}
!27 = !{i32 2, !"Debug Info Version", i32 3}
!28 = !{i32 2, !"CodeView", i32 1}
!29 = distinct !DISubprogram(name: "main", scope: !25, file: !25, line: 5, type: !30, scopeLine: 6, spFlags: DISPFlagDefinition, unit: !24, retainedNodes: !33)
!30 = !DISubroutineType(types: !31)
!31 = !{!32}
!32 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!33 = !{}
!34 = !DILocation(line: 7, column: 2, scope: !29)
!35 = !DILocalVariable(name: "result", scope: !29, file: !25, line: 7, type: !36, align: 2048)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "String_Builder", scope: !2, file: !2, line: 10, size: 2176, align: 2048, elements: !37)
!37 = !{!38, !43, !44}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !2, file: !2, line: 12, baseType: !39, size: 2048, align: 8)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 2048, align: 8, elements: !41)
!40 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!41 = !{!42}
!42 = !DISubrange(count: 256, lowerBound: 0)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !2, file: !2, line: 13, baseType: !3, size: 64, align: 64, offset: 2048)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2, file: !2, line: 14, baseType: !45, size: 64, align: 64, offset: 2112)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!46 = !DILocation(line: 8, column: 2, scope: !29)
!47 = !DILocation(line: 9, column: 2, scope: !29)
!48 = !DILocalVariable(name: "str", scope: !29, file: !25, line: 9, type: !49, align: 64)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", scope: !2, file: !2, line: 4, size: 128, align: 64, elements: !50)
!50 = !{!51, !53}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !2, file: !2, line: 6, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !2, file: !2, line: 7, baseType: !3, size: 64, align: 64, offset: 64)
!54 = !DILocation(line: 11, column: 7, scope: !29)
!55 = !DILocation(line: 12, column: 7, scope: !29)
!56 = !DILocation(line: 13, column: 5, scope: !29)
!57 = distinct !DISubprogram(name: "builder_to_string", scope: !2, file: !2, line: 17, type: !58, scopeLine: 18, spFlags: DISPFlagDefinition, unit: !24, retainedNodes: !33)
!58 = !DISubroutineType(types: !59)
!59 = !{null, !45}
!60 = !DILocalVariable(name: "builder", arg: 1, scope: !57, file: !2, line: 17, type: !45)
!61 = !DILocation(line: 17, scope: !57)
!62 = !DILocation(line: 19, column: 2, scope: !57)
!63 = !DILocalVariable(name: "out", scope: !57, file: !2, line: 19, type: !49, align: 64)
!64 = !DILocation(line: 20, column: 2, scope: !57)
!65 = !DILocalVariable(name: "out_len", scope: !57, file: !2, line: 20, type: !3, align: 64)
!66 = !DILocation(line: 21, column: 2, scope: !57)
!67 = !DILocalVariable(name: "current", scope: !57, file: !2, line: 21, type: !45, align: 64)
!68 = !DILocation(line: 22, column: 2, scope: !57)
!69 = !DILocalVariable(name: "i", scope: !57, file: !2, line: 22, type: !3, align: 64)
!70 = !DILocation(line: 22, column: 6, scope: !57)
!71 = !DILocation(line: 23, column: 3, scope: !57)
!72 = !DILocation(line: 24, column: 3, scope: !57)
!73 = !DILocation(line: 25, column: 2, scope: !57)
!74 = !DILocation(line: 26, column: 2, scope: !57)
!75 = !DILocation(line: 27, column: 2, scope: !57)
!76 = !DILocation(line: 28, column: 2, scope: !57)
!77 = !DILocation(line: 30, column: 2, scope: !57)
!78 = !DILocalVariable(name: "times", scope: !57, file: !2, line: 30, type: !3, align: 64)
!79 = !DILocation(line: 31, column: 2, scope: !57)
!80 = !DILocalVariable(name: "i", scope: !57, file: !2, line: 31, type: !3, align: 64)
!81 = !DILocation(line: 31, column: 6, scope: !57)
!82 = !DILocation(line: 32, column: 7, scope: !57)
!83 = !DILocation(line: 33, column: 3, scope: !57)
!84 = !DILocation(line: 34, column: 3, scope: !57)
!85 = !DILocation(line: 35, column: 2, scope: !57)
!86 = !DILocation(line: 36, column: 6, scope: !57)
!87 = !DILocation(line: 37, column: 2, scope: !57)
!88 = !DILocation(line: 38, column: 5, scope: !57)
!89 = distinct !DISubprogram(name: "init_builder", scope: !2, file: !2, line: 41, type: !90, scopeLine: 42, spFlags: DISPFlagDefinition, unit: !24, retainedNodes: !33)
!90 = !DISubroutineType(types: !91)
!91 = !{null, !52}
!92 = !DILocalVariable(name: "text", arg: 1, scope: !89, file: !2, line: 41, type: !52)
!93 = !DILocation(line: 41, scope: !89)
!94 = !DILocation(line: 43, column: 2, scope: !89)
!95 = !DILocalVariable(name: "out", scope: !89, file: !2, line: 43, type: !36, align: 2048)
!96 = !DILocation(line: 44, column: 2, scope: !89)
!97 = !DILocalVariable(name: "current", scope: !89, file: !2, line: 44, type: !45, align: 64)
!98 = !DILocation(line: 45, column: 2, scope: !89)
!99 = !DILocalVariable(name: "times", scope: !89, file: !2, line: 45, type: !3, align: 64)
!100 = !DILocation(line: 46, column: 2, scope: !89)
!101 = !DILocalVariable(name: "i", scope: !89, file: !2, line: 46, type: !3, align: 64)
!102 = !DILocation(line: 46, column: 6, scope: !89)
!103 = !DILocation(line: 47, column: 3, scope: !89)
!104 = !DILocation(line: 48, column: 3, scope: !89)
!105 = !DILocation(line: 49, column: 3, scope: !89)
!106 = !DILocation(line: 55, column: 2, scope: !89)
!107 = !DILocation(line: 56, column: 5, scope: !89)
!108 = !DILocation(line: 50, column: 4, scope: !89)
!109 = !DILocation(line: 51, column: 4, scope: !89)
!110 = !DILocation(line: 52, column: 4, scope: !89)
!111 = !DILocation(line: 53, column: 4, scope: !89)
!112 = !DILocation(line: 54, column: 3, scope: !89)
!113 = distinct !DISubprogram(name: "compare", scope: !2, file: !2, line: 111, type: !114, scopeLine: 112, spFlags: DISPFlagDefinition, unit: !24, retainedNodes: !33)
!114 = !DISubroutineType(types: !115)
!115 = !{!18, !49, !49}
!116 = !DILocalVariable(name: "str1", arg: 1, scope: !113, file: !2, line: 111, type: !49)
!117 = !DILocation(line: 111, scope: !113)
!118 = !DILocalVariable(name: "str2", arg: 2, scope: !113, file: !2, line: 111, type: !49)
!119 = !DILocation(line: 113, column: 2, scope: !113)
!120 = !DILocation(line: 116, column: 2, scope: !113)
!121 = !DILocation(line: 114, column: 6, scope: !113)
!122 = !DILocalVariable(name: "i", scope: !113, file: !2, line: 116, type: !3, align: 64)
!123 = !DILocation(line: 116, column: 6, scope: !113)
!124 = !DILocation(line: 117, column: 3, scope: !113)
!125 = !DILocation(line: 118, column: 5, scope: !113)
!126 = !DILocation(line: 117, column: 38, scope: !113)
!127 = distinct !DISubprogram(name: "to_string", scope: !2, file: !2, line: 121, type: !90, scopeLine: 122, spFlags: DISPFlagDefinition, unit: !24, retainedNodes: !33)
!128 = !DILocalVariable(name: "text", arg: 1, scope: !127, file: !2, line: 121, type: !52)
!129 = !DILocation(line: 121, scope: !127)
!130 = !DILocation(line: 123, column: 2, scope: !127)
!131 = !DILocalVariable(name: "text_len", scope: !127, file: !2, line: 123, type: !3, align: 64)
!132 = !DILocation(line: 124, column: 2, scope: !127)
!133 = !DILocalVariable(name: "allocated", scope: !127, file: !2, line: 124, type: !23, align: 64)
!134 = !DILocation(line: 125, column: 6, scope: !127)
!135 = !DILocation(line: 126, column: 2, scope: !127)
!136 = !DILocalVariable(name: "str", scope: !127, file: !2, line: 126, type: !49, align: 64)
!137 = !DILocation(line: 127, column: 5, scope: !127)
!138 = distinct !DISubprogram(name: "terminate_string", scope: !2, file: !2, line: 130, type: !139, scopeLine: 131, spFlags: DISPFlagDefinition, unit: !24, retainedNodes: !33)
!139 = !DISubroutineType(types: !140)
!140 = !{null, !49}
!141 = !DILocalVariable(name: "str", arg: 1, scope: !138, file: !2, line: 130, type: !49)
!142 = !DILocation(line: 130, scope: !138)
!143 = !DILocation(line: 132, column: 2, scope: !138)
!144 = !DILocalVariable(name: "out", scope: !138, file: !2, line: 132, type: !49, align: 64)
!145 = !DILocation(line: 133, column: 2, scope: !138)
!146 = !DILocation(line: 134, column: 2, scope: !138)
!147 = !DILocation(line: 135, column: 6, scope: !138)
!148 = !DILocation(line: 136, column: 2, scope: !138)
!149 = !DILocation(line: 137, column: 5, scope: !138)
!150 = distinct !DISubprogram(name: "build_unsigned_int", scope: !2, file: !2, line: 140, type: !151, scopeLine: 140, spFlags: DISPFlagDefinition, unit: !24, retainedNodes: !33)
!151 = !DISubroutineType(types: !152)
!152 = !{null, !153, !3, !45}
!153 = !DIBasicType(name: "u64", size: 32, encoding: DW_ATE_unsigned)
!154 = !DILocalVariable(name: "num", arg: 1, scope: !150, file: !2, line: 140, type: !153)
!155 = !DILocation(line: 140, scope: !150)
!156 = !DILocalVariable(name: "num_size", arg: 2, scope: !150, file: !2, line: 140, type: !3)
!157 = !DILocalVariable(name: "builder", arg: 3, scope: !150, file: !2, line: 140, type: !45)
!158 = !DILocation(line: 141, column: 2, scope: !150)
!159 = !DILocation(line: 146, column: 1, scope: !150)
!160 = !DILocation(line: 142, column: 3, scope: !150)
!161 = !DILocalVariable(name: "digit", scope: !150, file: !2, line: 142, type: !153, align: 64)
!162 = !DILocation(line: 143, column: 21, scope: !150)
!163 = !DILocation(line: 144, column: 4, scope: !150)
!164 = !DILocation(line: 145, column: 2, scope: !150)
!165 = distinct !DISubprogram(name: "int_to_str", scope: !2, file: !2, line: 148, type: !166, scopeLine: 149, spFlags: DISPFlagDefinition, unit: !24, retainedNodes: !33)
!166 = !DISubroutineType(types: !167)
!167 = !{null, !3, !45}
!168 = !DILocalVariable(name: "num", arg: 1, scope: !165, file: !2, line: 148, type: !3)
!169 = !DILocation(line: 148, scope: !165)
!170 = !DILocalVariable(name: "builder", arg: 2, scope: !165, file: !2, line: 148, type: !45)
!171 = !DILocation(line: 150, column: 2, scope: !165)
!172 = !DILocation(line: 157, column: 2, scope: !165)
!173 = !DILocation(line: 151, column: 4, scope: !165)
!174 = !DILocation(line: 152, column: 5, scope: !165)
!175 = !DILocation(line: 154, column: 2, scope: !165)
!176 = !DILocalVariable(name: "div_copy", scope: !165, file: !2, line: 154, type: !3, align: 64)
!177 = !DILocation(line: 155, column: 2, scope: !165)
!178 = !DILocalVariable(name: "num_size", scope: !165, file: !2, line: 155, type: !3, align: 64)
!179 = !DILocation(line: 158, column: 3, scope: !165)
!180 = !DILocation(line: 159, column: 2, scope: !165)
!181 = !DILocation(line: 160, column: 2, scope: !165)
!182 = !DILocation(line: 166, column: 1, scope: !165)
!183 = !DILocation(line: 161, column: 4, scope: !165)
!184 = !DILocation(line: 162, column: 3, scope: !165)
!185 = !DILocation(line: 163, column: 3, scope: !165)
!186 = !DILocation(line: 164, column: 2, scope: !165)
!187 = !DILocation(line: 165, column: 20, scope: !165)
!188 = distinct !DISubprogram(name: "float_to_str", scope: !2, file: !2, line: 168, type: !189, scopeLine: 169, spFlags: DISPFlagDefinition, unit: !24, retainedNodes: !33)
!189 = !DISubroutineType(types: !190)
!190 = !{null, !191, !45}
!191 = !DIBasicType(name: "f64", size: 64, encoding: DW_ATE_float)
!192 = !DILocalVariable(name: "num", arg: 1, scope: !188, file: !2, line: 168, type: !191)
!193 = !DILocation(line: 168, scope: !188)
!194 = !DILocalVariable(name: "builder", arg: 2, scope: !188, file: !2, line: 168, type: !45)
!195 = !DILocation(line: 170, column: 2, scope: !188)
!196 = !DILocation(line: 185, column: 2, scope: !188)
!197 = !DILocation(line: 171, column: 4, scope: !188)
!198 = !DILocation(line: 172, column: 3, scope: !188)
!199 = !DILocation(line: 175, column: 2, scope: !188)
!200 = !DILocalVariable(name: "decimal", scope: !188, file: !2, line: 175, type: !153, align: 64)
!201 = !DILocation(line: 176, column: 2, scope: !188)
!202 = !DILocation(line: 178, column: 2, scope: !188)
!203 = !DILocation(line: 179, column: 4, scope: !188)
!204 = !DILocation(line: 180, column: 2, scope: !188)
!205 = !DILocation(line: 182, column: 3, scope: !188)
!206 = !DILocation(line: 183, column: 2, scope: !188)
!207 = !DILocalVariable(name: "zeroes_to_append", scope: !188, file: !2, line: 183, type: !3, align: 64)
!208 = !DILocation(line: 181, column: 17, scope: !188)
!209 = !DILocation(line: 181, column: 2, scope: !188)
!210 = !DILocation(line: 186, column: 3, scope: !188)
!211 = !DILocation(line: 187, column: 3, scope: !188)
!212 = !DILocation(line: 188, column: 2, scope: !188)
!213 = !DILocation(line: 190, column: 2, scope: !188)
!214 = !DILocalVariable(name: "i", scope: !188, file: !2, line: 190, type: !3, align: 64)
!215 = !DILocation(line: 190, column: 6, scope: !188)
!216 = !DILocation(line: 187, column: 20, scope: !188)
!217 = !DILocation(line: 191, column: 4, scope: !188)
!218 = !DILocation(line: 192, column: 2, scope: !188)
!219 = !DILocation(line: 194, column: 12, scope: !188)
!220 = !DILocation(line: 195, column: 1, scope: !188)
!221 = distinct !DISubprogram(name: "parse_format", scope: !2, file: !2, line: 197, type: !222, scopeLine: 198, spFlags: DISPFlagDefinition, unit: !24, retainedNodes: !33)
!222 = !DISubroutineType(types: !223)
!223 = !{null, !49, !224}
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "Any", scope: !17, file: !17, line: 51, size: 128, align: 64, elements: !226)
!226 = !{!227, !282}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !17, file: !17, line: 52, baseType: !228, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Info", scope: !17, file: !17, line: 56, size: 320, align: 64, elements: !230)
!230 = !{!231, !232, !237, !250, !258, !265, !273}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !17, file: !17, line: 57, baseType: !32, size: 32, align: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "primitive", scope: !17, file: !17, line: 66, baseType: !233, size: 64, align: 32)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Primitive", scope: !17, file: !17, line: 66, size: 64, align: 32, elements: !234)
!234 = !{!235, !236}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !17, file: !17, line: 67, baseType: !32, size: 32, align: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !17, file: !17, line: 68, baseType: !32, size: 32, align: 32, offset: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !17, file: !17, line: 71, baseType: !238, size: 320, align: 64)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Struct", scope: !17, file: !17, line: 71, size: 320, align: 64, elements: !239)
!239 = !{!240, !241, !242, !243, !244, !245, !247}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !17, file: !17, line: 72, baseType: !32, size: 32, align: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "member_count", scope: !17, file: !17, line: 73, baseType: !32, size: 32, align: 32, offset: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "is_union", scope: !17, file: !17, line: 74, baseType: !18, size: 8, align: 8, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "is_packed", scope: !17, file: !17, line: 75, baseType: !18, size: 8, align: 8, offset: 72)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !17, file: !17, line: 76, baseType: !52, size: 64, align: 64, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "member_names", scope: !17, file: !17, line: 77, baseType: !246, size: 64, align: 64, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "member_types", scope: !17, file: !17, line: 78, baseType: !248, size: 64, align: 64, offset: 256)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Info", scope: !17, file: !17, line: 78, size: 320, align: 64, elements: !230)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !17, file: !17, line: 81, baseType: !251, size: 192, align: 64)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Array", scope: !17, file: !17, line: 81, size: 192, align: 64, elements: !252)
!252 = !{!253, !254, !257}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !17, file: !17, line: 82, baseType: !32, size: 32, align: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !17, file: !17, line: 83, baseType: !255, size: 64, align: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Info", scope: !17, file: !17, line: 83, size: 320, align: 64, elements: !230)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "elem_count", scope: !17, file: !17, line: 84, baseType: !153, size: 64, align: 64, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !17, file: !17, line: 87, baseType: !259, size: 128, align: 64)
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Pointer", scope: !17, file: !17, line: 87, size: 128, align: 64, elements: !260)
!260 = !{!261, !262}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !17, file: !17, line: 88, baseType: !32, size: 32, align: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "pointed", scope: !17, file: !17, line: 89, baseType: !263, size: 64, align: 64, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Info", scope: !17, file: !17, line: 89, size: 320, align: 64, elements: !230)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "enumerator", scope: !17, file: !17, line: 92, baseType: !266, size: 256, align: 64)
!266 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Enum", scope: !17, file: !17, line: 92, size: 256, align: 64, elements: !267)
!267 = !{!268, !269, !270, !271}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !17, file: !17, line: 93, baseType: !32, size: 32, align: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !17, file: !17, line: 94, baseType: !233, size: 64, align: 32, offset: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "names", scope: !17, file: !17, line: 95, baseType: !246, size: 64, align: 64, offset: 128)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !17, file: !17, line: 96, baseType: !272, size: 64, align: 64, offset: 192)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !17, file: !17, line: 99, baseType: !274, size: 256, align: 64)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Func", scope: !17, file: !17, line: 99, size: 256, align: 64, elements: !275)
!275 = !{!276, !277, !280, !281}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !17, file: !17, line: 100, baseType: !32, size: 32, align: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "param_types", scope: !17, file: !17, line: 101, baseType: !278, size: 64, align: 64, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Info", scope: !17, file: !17, line: 101, size: 320, align: 64, elements: !230)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "return_type", scope: !17, file: !17, line: 102, baseType: !278, size: 64, align: 64, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "calling_convention", scope: !17, file: !17, line: 103, baseType: !32, size: 32, align: 32, offset: 192)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !17, file: !17, line: 53, baseType: !23, size: 64, align: 64, offset: 64)
!283 = !DILocalVariable(name: "format", arg: 1, scope: !221, file: !2, line: 197, type: !49)
!284 = !DILocation(line: 197, scope: !221)
!285 = !DILocalVariable(name: "list", arg: 2, scope: !221, file: !2, line: 197, type: !224)
!286 = !DILocation(line: 199, column: 2, scope: !221)
!287 = !DILocalVariable(name: "builder", scope: !221, file: !2, line: 199, type: !36, align: 2048)
!288 = !DILocation(line: 200, column: 2, scope: !221)
!289 = !DILocalVariable(name: "list_index", scope: !221, file: !2, line: 200, type: !3, align: 64)
!290 = !DILocation(line: 201, column: 2, scope: !221)
!291 = !DILocalVariable(name: "i", scope: !221, file: !2, line: 201, type: !3, align: 64)
!292 = !DILocation(line: 201, column: 6, scope: !221)
!293 = !DILocation(line: 202, column: 3, scope: !221)
!294 = !DILocation(line: 217, column: 2, scope: !221)
!295 = !DILocation(line: 218, column: 2, scope: !221)
!296 = !DILocation(line: 219, column: 2, scope: !221)
!297 = !DILocalVariable(name: "out", scope: !221, file: !2, line: 219, type: !49, align: 64)
!298 = !DILocation(line: 220, column: 5, scope: !221)
!299 = !DILocation(line: 203, column: 4, scope: !221)
!300 = !DILocalVariable(name: "item", scope: !221, file: !2, line: 203, type: !225, align: 64)
!301 = !DILocation(line: 204, column: 4, scope: !221)
!302 = !DILocation(line: 205, column: 4, scope: !221)
!303 = !DILocalVariable(name: "type", scope: !221, file: !2, line: 205, type: !32, align: 32)
!304 = !DILocation(line: 206, column: 4, scope: !221)
!305 = !DILocation(line: 214, column: 3, scope: !221)
!306 = !DILocation(line: 207, column: 15, scope: !221)
!307 = !DILocation(line: 208, column: 4, scope: !221)
!308 = !DILocation(line: 208, column: 11, scope: !221)
!309 = !DILocation(line: 208, column: 6, scope: !221)
!310 = !DILocation(line: 209, column: 11, scope: !221)
!311 = !DILocation(line: 210, column: 17, scope: !221)
!312 = !DILocation(line: 211, column: 4, scope: !221)
!313 = !DILocation(line: 212, column: 5, scope: !221)
!314 = !DILocation(line: 211, column: 6, scope: !221)
!315 = !DILocation(line: 215, column: 4, scope: !221)
!316 = !DILocation(line: 216, column: 3, scope: !221)
!317 = distinct !DISubprogram(name: "print!@* u8!@-", scope: !2, file: !2, line: 223, type: !90, scopeLine: 224, spFlags: DISPFlagDefinition, unit: !24, retainedNodes: !33)
!318 = !DILocalVariable(name: "format", arg: 1, scope: !317, file: !2, line: 223, type: !52)
!319 = !DILocation(line: 223, scope: !317)
!320 = !DILocation(line: 225, column: 2, scope: !317)
!321 = !DILocalVariable(name: "str", scope: !317, file: !2, line: 225, type: !49, align: 64)
!322 = !DILocation(line: 226, column: 2, scope: !317)
!323 = !DILocalVariable(name: "list", scope: !317, file: !2, line: 226, type: !224, align: 64)
!324 = !DILocation(line: 227, column: 15, scope: !317)
!325 = !DILocation(line: 228, column: 2, scope: !317)
!326 = !DILocalVariable(name: "out", scope: !317, file: !2, line: 228, type: !49, align: 64)
!327 = !DILocation(line: 229, column: 14, scope: !317)
!328 = !DILocation(line: 230, column: 2, scope: !317)
!329 = !DILocalVariable(name: "stdout", scope: !317, file: !2, line: 230, type: !23, align: 64)
!330 = !DILocation(line: 231, column: 12, scope: !317)
!331 = !DILocation(line: 232, column: 1, scope: !317)
!332 = distinct !DISubprogram(name: "print!@string!@-", scope: !2, file: !2, line: 234, type: !139, scopeLine: 235, spFlags: DISPFlagDefinition, unit: !24, retainedNodes: !33)
!333 = !DILocalVariable(name: "format", arg: 1, scope: !332, file: !2, line: 234, type: !49)
!334 = !DILocation(line: 234, scope: !332)
!335 = !DILocation(line: 236, column: 2, scope: !332)
!336 = !DILocalVariable(name: "list", scope: !332, file: !2, line: 236, type: !224, align: 64)
!337 = !DILocation(line: 237, column: 15, scope: !332)
!338 = !DILocation(line: 238, column: 2, scope: !332)
