; ModuleID = 'Test.apoc'
source_filename = "Test.apoc"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%__Internal_Context = type { ptr }
%string = type { ptr, i64 }
%String_Builder = type { [256 x i8], i64, ptr }
%Any = type { ptr, ptr }

@global_var = constant i8 1, !dbg !0
@global_var.1 = constant i8 0, !dbg !4
@global_var.2 = constant ptr null, !dbg !6
@global_var.3 = constant i64 256, !dbg !10
@global_var.4 = global i64 0, !dbg !14
@global_var.5 = constant i64 65536, !dbg !16
@global_var.6 = constant i64 131072, !dbg !19
@global_var.7 = constant i64 262144, !dbg !21
@global_var.8 = constant i64 524288, !dbg !23
@global_var.9 = constant i64 1048576, !dbg !25
@0 = private unnamed_addr constant [14 x i8] c"my big string\00", align 1
@1 = private unnamed_addr constant [2 x i8] c"1\00", align 1
@2 = private unnamed_addr constant [11 x i8] c" more text\00", align 1
@3 = private unnamed_addr constant [2 x i8] c"2\00", align 1
@4 = private unnamed_addr constant [2 x i8] c"3\00", align 1
@5 = private unnamed_addr constant [2 x i8] c"4\00", align 1
@6 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1

declare void @var_arg_start(ptr, ptr)

declare void @var_arg_stop(ptr, ptr)

define i32 @main(ptr %__apoc_internal_context) !dbg !39 {
entry:
  %__apoc_internal_context5 = alloca %__Internal_Context, align 16
  %str = alloca %string, align 16

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "true", scope: !2, file: !2, line: 2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "Basic.apoc", directory: "W:\\Apocalypse\\Standard")
!3 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "false", scope: !2, file: !2, line: 3, type: !3, isLocal: true, isDefinition: true)
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "null", scope: !2, file: !2, line: 4, type: !8, isLocal: true, isDefinition: true)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIBasicType(tag: DW_TAG_unspecified_type, name: "void")
!10 = !DIGlobalVariableExpression(var: !11, expr: !DIExpression())
!11 = distinct !DIGlobalVariable(name: "STRING_BUFFER_SIZE", scope: !12, file: !12, line: 2, type: !13, isLocal: true, isDefinition: true)
!12 = !DIFile(filename: "String.apoc", directory: "W:\\Apocalypse\\Standard")
!13 = !DIBasicType(name: "i64", size: 64, encoding: DW_ATE_signed)
!14 = !DIGlobalVariableExpression(var: !15, expr: !DIExpression())
!15 = distinct !DIGlobalVariable(name: "called", scope: !12, file: !12, line: 92, type: !13, isLocal: true, isDefinition: true)
!16 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression())
!17 = distinct !DIGlobalVariable(name: "DELETE", scope: !18, file: !18, line: 58, type: !13, isLocal: true, isDefinition: true)
!18 = !DIFile(filename: "Windows.apoc", directory: "W:\\Apocalypse\\Standard")
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(name: "READ_CONTROL", scope: !18, file: !18, line: 59, type: !13, isLocal: true, isDefinition: true)
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(name: "WRITE_DAC", scope: !18, file: !18, line: 60, type: !13, isLocal: true, isDefinition: true)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "WRITE_OWNER", scope: !18, file: !18, line: 61, type: !13, isLocal: true, isDefinition: true)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "SYNCHRONIZE", scope: !18, file: !18, line: 62, type: !13, isLocal: true, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Apoc Compiler", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug)
!28 = !DIFile(filename: "Test.apoc", directory: "W:\\Apocalypse")
!29 = distinct !DICompileUnit(language: DW_LANG_C99, file: !2, producer: "Apoc Compiler", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug)
!30 = distinct !DICompileUnit(language: DW_LANG_C99, file: !31, producer: "Apoc Compiler", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug)
!31 = !DIFile(filename: "C_Standard.apoc", directory: "W:\\Apocalypse\\Standard")
!32 = distinct !DICompileUnit(language: DW_LANG_C99, file: !33, producer: "Apoc Compiler", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug)
!33 = !DIFile(filename: "OS.apoc", directory: "W:\\Apocalypse\\Standard")
!34 = distinct !DICompileUnit(language: DW_LANG_C99, file: !12, producer: "Apoc Compiler", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug)
!35 = distinct !DICompileUnit(language: DW_LANG_C99, file: !18, producer: "Apoc Compiler", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !36)
!36 = !{!0, !4, !6, !10, !14, !16, !19, !21, !23, !25}
!37 = !{i32 2, !"Debug Info Version", i32 3}
!38 = !{i32 2, !"CodeView", i32 1}
!39 = distinct !DISubprogram(name: "main", scope: !28, file: !28, line: 5, type: !40, scopeLine: 6, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !35, retainedNodes: !43)
!40 = !DISubroutineType(types: !41)
!41 = !{!42}
!42 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!43 = !{}
!44 = !DILocation(line: 7, column: 2, scope: !39)
!45 = !DILocalVariable(name: "result", scope: !39, file: !28, line: 7, type: !46, align: 128)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "String_Builder", scope: !12, file: !12, line: 10, size: 2176, align: 2048, elements: !47)
!47 = !{!48, !53, !54}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !12, file: !12, line: 12, baseType: !49, size: 2048, align: 128)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 2048, align: 8, elements: !51)
!50 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!51 = !{!52}
!52 = !DISubrange(count: 256, lowerBound: 0)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !12, file: !12, line: 13, baseType: !13, size: 64, align: 64, offset: 2048)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !12, file: !12, line: 14, baseType: !55, size: 64, align: 64, offset: 2112)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!56 = !DILocation(line: 9, column: 6, scope: !39)
!57 = !DILocation(line: 15, column: 2, scope: !39)
!58 = !DILocation(line: 16, column: 2, scope: !39)
!59 = !DILocalVariable(name: "str", scope: !39, file: !28, line: 16, type: !60, align: 128)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", scope: !12, file: !12, line: 4, size: 128, align: 64, elements: !61)
!61 = !{!62, !64}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !12, file: !12, line: 6, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !12, file: !12, line: 7, baseType: !13, size: 64, align: 64, offset: 64)
!65 = !DILocation(line: 18, column: 7, scope: !39)
!66 = !DILocation(line: 12, column: 7, scope: !39)
!67 = !DILocation(line: 13, column: 7, scope: !39)
!68 = !DILocation(line: 10, column: 12, scope: !39)
!69 = !DILocation(line: 19, column: 5, scope: !39)
!70 = distinct !DISubprogram(name: "mem_alloc", scope: !31, file: !31, line: 11, type: !71, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !35, retainedNodes: !43)
!71 = !DISubroutineType(types: !72)
!72 = !{!8, !73}
!73 = !DIBasicType(name: "u64", size: 32, encoding: DW_ATE_unsigned)
!74 = !DILocalVariable(name: "size", arg: 1, scope: !70, file: !31, line: 11, type: !73)
!75 = !DILocation(line: 11, scope: !70)
!76 = !DILocation(line: 13, column: 2, scope: !70)
!77 = !DILocalVariable(name: "result", scope: !70, file: !31, line: 13, type: !8, align: 64)
!78 = !DILocation(line: 14, column: 8, scope: !70)
!79 = !DILocation(line: 15, column: 5, scope: !70)
!80 = distinct !DISubprogram(name: "builder_to_string", scope: !12, file: !12, line: 17, type: !81, scopeLine: 18, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !35, retainedNodes: !43)
!81 = !DISubroutineType(types: !82)
!82 = !{!9, !55}
!83 = !DILocalVariable(name: "builder", arg: 1, scope: !80, file: !12, line: 17, type: !55)
!84 = !DILocation(line: 17, scope: !80)
!85 = !DILocation(line: 19, column: 2, scope: !80)
!86 = !DILocalVariable(name: "out", scope: !80, file: !12, line: 19, type: !60, align: 128)
!87 = !DILocation(line: 20, column: 2, scope: !80)
!88 = !DILocalVariable(name: "out_len", scope: !80, file: !12, line: 20, type: !13, align: 64)
!89 = !DILocation(line: 21, column: 2, scope: !80)
!90 = !DILocalVariable(name: "current", scope: !80, file: !12, line: 21, type: !55, align: 64)
!91 = !DILocation(line: 22, column: 2, scope: !80)
!92 = !DILocalVariable(name: "i", scope: !80, file: !12, line: 22, type: !13, align: 64)
!93 = !DILocation(line: 22, column: 6, scope: !80)
!94 = !DILocation(line: 23, column: 3, scope: !80)
!95 = !DILocation(line: 24, column: 3, scope: !80)
!96 = !DILocation(line: 25, column: 2, scope: !80)
!97 = !DILocation(line: 26, column: 2, scope: !80)
!98 = !DILocation(line: 27, column: 2, scope: !80)
!99 = !DILocation(line: 28, column: 2, scope: !80)
!100 = !DILocation(line: 30, column: 2, scope: !80)
!101 = !DILocalVariable(name: "times", scope: !80, file: !12, line: 30, type: !13, align: 64)
!102 = !DILocation(line: 31, column: 2, scope: !80)
!103 = !DILocalVariable(name: "i", scope: !80, file: !12, line: 31, type: !13, align: 64)
!104 = !DILocation(line: 31, column: 6, scope: !80)
!105 = !DILocation(line: 32, column: 7, scope: !80)
!106 = !DILocation(line: 33, column: 3, scope: !80)
!107 = !DILocation(line: 34, column: 3, scope: !80)
!108 = !DILocation(line: 35, column: 2, scope: !80)
!109 = !DILocation(line: 36, column: 6, scope: !80)
!110 = !DILocation(line: 37, column: 2, scope: !80)
!111 = !DILocation(line: 38, column: 5, scope: !80)
!112 = distinct !DISubprogram(name: "init_builder", scope: !12, file: !12, line: 41, type: !113, scopeLine: 42, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !35, retainedNodes: !43)
!113 = !DISubroutineType(types: !114)
!114 = !{!9, !63}
!115 = !DILocalVariable(name: "text", arg: 1, scope: !112, file: !12, line: 41, type: !63)
!116 = !DILocation(line: 41, scope: !112)
!117 = !DILocation(line: 43, column: 2, scope: !112)
!118 = !DILocalVariable(name: "out", scope: !112, file: !12, line: 43, type: !46, align: 128)
!119 = !DILocation(line: 44, column: 2, scope: !112)
!120 = !DILocation(line: 45, column: 2, scope: !112)
!121 = !DILocalVariable(name: "current", scope: !112, file: !12, line: 45, type: !55, align: 64)
!122 = !DILocation(line: 46, column: 2, scope: !112)
!123 = !DILocalVariable(name: "times", scope: !112, file: !12, line: 46, type: !13, align: 64)
!124 = !DILocation(line: 47, column: 2, scope: !112)
!125 = !DILocalVariable(name: "i", scope: !112, file: !12, line: 47, type: !13, align: 64)
!126 = !DILocation(line: 47, column: 6, scope: !112)
!127 = !DILocation(line: 48, column: 3, scope: !112)
!128 = !DILocation(line: 49, column: 3, scope: !112)
!129 = !DILocation(line: 50, column: 3, scope: !112)
!130 = !DILocation(line: 56, column: 2, scope: !112)
!131 = !DILocation(line: 57, column: 5, scope: !112)
!132 = !DILocation(line: 51, column: 4, scope: !112)
!133 = !DILocation(line: 52, column: 4, scope: !112)
!134 = !DILocation(line: 53, column: 4, scope: !112)
!135 = !DILocation(line: 54, column: 4, scope: !112)
!136 = !DILocation(line: 55, column: 3, scope: !112)
!137 = distinct !DISubprogram(name: "compare", scope: !12, file: !12, line: 113, type: !138, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !35, retainedNodes: !43)
!138 = !DISubroutineType(types: !139)
!139 = !{!3, !60, !60}
!140 = !DILocalVariable(name: "str1", arg: 1, scope: !137, file: !12, line: 113, type: !60)
!141 = !DILocation(line: 113, scope: !137)
!142 = !DILocalVariable(name: "str2", arg: 2, scope: !137, file: !12, line: 113, type: !60)
!143 = !DILocation(line: 115, column: 2, scope: !137)
!144 = !DILocation(line: 118, column: 2, scope: !137)
!145 = !DILocation(line: 116, column: 6, scope: !137)
!146 = !DILocalVariable(name: "i", scope: !137, file: !12, line: 118, type: !13, align: 64)
!147 = !DILocation(line: 118, column: 6, scope: !137)
!148 = !DILocation(line: 119, column: 3, scope: !137)
!149 = !DILocation(line: 120, column: 5, scope: !137)
!150 = !DILocation(line: 119, column: 38, scope: !137)
!151 = distinct !DISubprogram(name: "to_string", scope: !12, file: !12, line: 123, type: !113, scopeLine: 124, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !35, retainedNodes: !43)
!152 = !DILocalVariable(name: "text", arg: 1, scope: !151, file: !12, line: 123, type: !63)
!153 = !DILocation(line: 123, scope: !151)
!154 = !DILocation(line: 125, column: 2, scope: !151)
!155 = !DILocalVariable(name: "text_len", scope: !151, file: !12, line: 125, type: !13, align: 64)
!156 = !DILocation(line: 126, column: 2, scope: !151)
!157 = !DILocalVariable(name: "allocated", scope: !151, file: !12, line: 126, type: !8, align: 64)
!158 = !DILocation(line: 127, column: 6, scope: !151)
!159 = !DILocation(line: 128, column: 2, scope: !151)
!160 = !DILocalVariable(name: "str", scope: !151, file: !12, line: 128, type: !60, align: 128)
!161 = !DILocation(line: 129, column: 5, scope: !151)
!162 = distinct !DISubprogram(name: "terminate_string", scope: !12, file: !12, line: 132, type: !163, scopeLine: 133, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !35, retainedNodes: !43)
!163 = !DISubroutineType(types: !164)
!164 = !{!9, !60}
!165 = !DILocalVariable(name: "str", arg: 1, scope: !162, file: !12, line: 132, type: !60)
!166 = !DILocation(line: 132, scope: !162)
!167 = !DILocation(line: 134, column: 2, scope: !162)
!168 = !DILocalVariable(name: "out", scope: !162, file: !12, line: 134, type: !60, align: 128)
!169 = !DILocation(line: 135, column: 2, scope: !162)
!170 = !DILocation(line: 136, column: 2, scope: !162)
!171 = !DILocation(line: 137, column: 6, scope: !162)
!172 = !DILocation(line: 138, column: 2, scope: !162)
!173 = !DILocation(line: 139, column: 5, scope: !162)
!174 = distinct !DISubprogram(name: "parse_format", scope: !12, file: !12, line: 143, type: !175, scopeLine: 144, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !35, retainedNodes: !43)
!175 = !DISubroutineType(types: !176)
!176 = !{!9, !60, !177}
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "Any", scope: !2, file: !2, line: 51, size: 128, align: 64, elements: !179)
!179 = !{!180, !235}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !2, file: !2, line: 52, baseType: !181, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Info", scope: !2, file: !2, line: 56, size: 320, align: 64, elements: !183)
!183 = !{!184, !185, !190, !203, !211, !218, !226}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !2, file: !2, line: 57, baseType: !42, size: 32, align: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "primitive", scope: !2, file: !2, line: 66, baseType: !186, size: 64, align: 128)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Primitive", scope: !2, file: !2, line: 66, size: 64, align: 32, elements: !187)
!187 = !{!188, !189}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !2, file: !2, line: 67, baseType: !42, size: 32, align: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2, file: !2, line: 68, baseType: !42, size: 32, align: 32, offset: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !2, file: !2, line: 71, baseType: !191, size: 320, align: 128)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Struct", scope: !2, file: !2, line: 71, size: 320, align: 64, elements: !192)
!192 = !{!193, !194, !195, !196, !197, !198, !200}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !2, file: !2, line: 72, baseType: !42, size: 32, align: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "member_count", scope: !2, file: !2, line: 73, baseType: !42, size: 32, align: 32, offset: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "is_union", scope: !2, file: !2, line: 74, baseType: !3, size: 8, align: 8, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "is_packed", scope: !2, file: !2, line: 75, baseType: !3, size: 8, align: 8, offset: 72)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2, file: !2, line: 76, baseType: !63, size: 64, align: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "member_names", scope: !2, file: !2, line: 77, baseType: !199, size: 64, align: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "member_types", scope: !2, file: !2, line: 78, baseType: !201, size: 64, align: 64, offset: 256)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Info", scope: !2, file: !2, line: 78, size: 320, align: 64, elements: !183)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !2, file: !2, line: 81, baseType: !204, size: 192, align: 128)
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Array", scope: !2, file: !2, line: 81, size: 192, align: 64, elements: !205)
!205 = !{!206, !207, !210}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !2, file: !2, line: 82, baseType: !42, size: 32, align: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !2, file: !2, line: 83, baseType: !208, size: 64, align: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Info", scope: !2, file: !2, line: 83, size: 320, align: 64, elements: !183)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "elem_count", scope: !2, file: !2, line: 84, baseType: !73, size: 64, align: 64, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !2, file: !2, line: 87, baseType: !212, size: 128, align: 128)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Pointer", scope: !2, file: !2, line: 87, size: 128, align: 64, elements: !213)
!213 = !{!214, !215}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !2, file: !2, line: 88, baseType: !42, size: 32, align: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "pointed", scope: !2, file: !2, line: 89, baseType: !216, size: 64, align: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Info", scope: !2, file: !2, line: 89, size: 320, align: 64, elements: !183)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "enumerator", scope: !2, file: !2, line: 92, baseType: !219, size: 256, align: 128)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Enum", scope: !2, file: !2, line: 92, size: 256, align: 64, elements: !220)
!220 = !{!221, !222, !223, !224}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !2, file: !2, line: 93, baseType: !42, size: 32, align: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !2, file: !2, line: 94, baseType: !186, size: 64, align: 128, offset: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "names", scope: !2, file: !2, line: 95, baseType: !199, size: 64, align: 64, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !2, file: !2, line: 96, baseType: !225, size: 64, align: 64, offset: 192)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !2, file: !2, line: 99, baseType: !227, size: 256, align: 128)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Func", scope: !2, file: !2, line: 99, size: 256, align: 64, elements: !228)
!228 = !{!229, !230, !233, !234}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !2, file: !2, line: 100, baseType: !42, size: 32, align: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "param_types", scope: !2, file: !2, line: 101, baseType: !231, size: 64, align: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Info", scope: !2, file: !2, line: 101, size: 320, align: 64, elements: !183)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "return_type", scope: !2, file: !2, line: 102, baseType: !231, size: 64, align: 64, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "calling_convention", scope: !2, file: !2, line: 103, baseType: !42, size: 32, align: 32, offset: 192)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !2, file: !2, line: 53, baseType: !8, size: 64, align: 64, offset: 64)
!236 = !DILocalVariable(name: "format", arg: 1, scope: !174, file: !12, line: 143, type: !60)
!237 = !DILocation(line: 143, scope: !174)
!238 = !DILocalVariable(name: "list", arg: 2, scope: !174, file: !12, line: 143, type: !177)
!239 = !DILocation(line: 145, column: 2, scope: !174)
!240 = !DILocalVariable(name: "builder", scope: !174, file: !12, line: 145, type: !46, align: 128)
!241 = !DILocation(line: 146, column: 2, scope: !174)
!242 = !DILocalVariable(name: "list_index", scope: !174, file: !12, line: 146, type: !13, align: 64)
!243 = !DILocation(line: 147, column: 2, scope: !174)
!244 = !DILocalVariable(name: "i", scope: !174, file: !12, line: 147, type: !13, align: 64)
!245 = !DILocation(line: 147, column: 6, scope: !174)
!246 = !DILocation(line: 148, column: 3, scope: !174)
!247 = !DILocation(line: 154, column: 2, scope: !174)
!248 = !DILocation(line: 155, column: 2, scope: !174)
!249 = !DILocation(line: 156, column: 2, scope: !174)
!250 = !DILocalVariable(name: "out", scope: !174, file: !12, line: 156, type: !60, align: 128)
!251 = !DILocation(line: 157, column: 5, scope: !174)
!252 = !DILocation(line: 149, column: 4, scope: !174)
!253 = !DILocalVariable(name: "item", scope: !174, file: !12, line: 149, type: !178, align: 128)
!254 = !DILocation(line: 150, column: 4, scope: !174)
!255 = !DILocation(line: 151, column: 3, scope: !174)
!256 = !DILocation(line: 152, column: 4, scope: !174)
!257 = !DILocation(line: 153, column: 3, scope: !174)
!258 = distinct !DISubprogram(name: "print!@* u8", scope: !12, file: !12, line: 160, type: !113, scopeLine: 161, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !35, retainedNodes: !43)
!259 = !DILocalVariable(name: "format", arg: 1, scope: !258, file: !12, line: 160, type: !63)
!260 = !DILocation(line: 160, scope: !258)
!261 = !DILocation(line: 162, column: 2, scope: !258)
!262 = !DILocalVariable(name: "str", scope: !258, file: !12, line: 162, type: !60, align: 128)
!263 = !DILocation(line: 163, column: 2, scope: !258)
!264 = !DILocalVariable(name: "list", scope: !258, file: !12, line: 163, type: !177, align: 64)
!265 = !DILocation(line: 164, column: 15, scope: !258)
!266 = !DILocation(line: 165, column: 2, scope: !258)
!267 = !DILocalVariable(name: "out", scope: !258, file: !12, line: 165, type: !60, align: 128)
!268 = !DILocation(line: 166, column: 14, scope: !258)
!269 = !DILocation(line: 167, column: 2, scope: !258)
!270 = !DILocalVariable(name: "stdout", scope: !258, file: !12, line: 167, type: !8, align: 64)
!271 = !DILocation(line: 168, column: 12, scope: !258)
!272 = !DILocation(line: 169, column: 1, scope: !258)
!273 = distinct !DISubprogram(name: "print!@string", scope: !12, file: !12, line: 171, type: !163, scopeLine: 172, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !35, retainedNodes: !43)
!274 = !DILocalVariable(name: "format", arg: 1, scope: !273, file: !12, line: 171, type: !60)
!275 = !DILocation(line: 171, scope: !273)
!276 = !DILocation(line: 173, column: 2, scope: !273)
!277 = !DILocalVariable(name: "list", scope: !273, file: !12, line: 173, type: !177, align: 64)
!278 = !DILocation(line: 174, column: 15, scope: !273)
!279 = !DILocation(line: 175, column: 2, scope: !273)
!280 = !DILocalVariable(name: "out", scope: !273, file: !12, line: 175, type: !60, align: 128)
!281 = !DILocation(line: 176, column: 14, scope: !273)
!282 = !DILocation(line: 177, column: 2, scope: !273)
!283 = !DILocalVariable(name: "stdout", scope: !273, file: !12, line: 177, type: !8, align: 64)
!284 = !DILocation(line: 178, column: 12, scope: !273)
!285 = !DILocation(line: 179, column: 1, scope: !273)
!286 = distinct !DISubprogram(name: "copy", scope: !12, file: !12, line: 182, type: !287, scopeLine: 183, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !35, retainedNodes: !43)
!287 = !DISubroutineType(types: !288)
!288 = !{!9, !8, !8, !73}
