; ModuleID = 'quick_test.apoc'
source_filename = "quick_test.apoc"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%String_Builder = type { [256 x i8], i64, ptr }
%string = type { ptr, i64 }
%__Internal_Context = type { ptr }
%Any = type { ptr, ptr }

@global_var = local_unnamed_addr constant i8 1, !dbg !0
@global_var.1 = local_unnamed_addr constant i8 0, !dbg !4
@global_var.2 = local_unnamed_addr constant ptr null, !dbg !6
@global_var.3 = local_unnamed_addr constant i64 256, !dbg !9
@global_var.4 = local_unnamed_addr constant i64 65536, !dbg !13
@global_var.5 = local_unnamed_addr constant i64 131072, !dbg !16
@global_var.6 = local_unnamed_addr constant i64 262144, !dbg !18
@global_var.7 = local_unnamed_addr constant i64 524288, !dbg !20
@global_var.8 = local_unnamed_addr constant i64 1048576, !dbg !22
@0 = private unnamed_addr constant [4 x i8] c"1st\00", align 1
@1 = private unnamed_addr constant [4 x i8] c"2nd\00", align 1
@2 = private unnamed_addr constant [4 x i8] c"3rd\00", align 1
@3 = private unnamed_addr constant [4 x i8] c"4th\00", align 1
@4 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@5 = private unnamed_addr constant [9 x i8] c"int: %f\0A\00", align 1

; Function Attrs: mustprogress nofree norecurse nosync nounwind readnone willreturn
define i32 @give_num() local_unnamed_addr #0 !dbg !29 {
entry:

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "true", scope: !2, file: !2, line: 2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "./Basic.apoc", directory: "E:\\C_Projects\\Apocalypse\\Standard")
!3 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "false", scope: !2, file: !2, line: 3, type: !3, isLocal: true, isDefinition: true)
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "null", scope: !2, file: !2, line: 4, type: !8, isLocal: true, isDefinition: true)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "STRING_BUFFER_SIZE", scope: !11, file: !11, line: 2, type: !12, isLocal: true, isDefinition: true)
!11 = !DIFile(filename: "./String.apoc", directory: "E:\\C_Projects\\Apocalypse\\Standard")
!12 = !DIBasicType(name: "i64", size: 64, encoding: DW_ATE_signed)
!13 = !DIGlobalVariableExpression(var: !14, expr: !DIExpression())
!14 = distinct !DIGlobalVariable(name: "DELETE", scope: !15, file: !15, line: 58, type: !12, isLocal: true, isDefinition: true)
!15 = !DIFile(filename: "./Windows.apoc", directory: "E:\\C_Projects\\Apocalypse\\Standard")
!16 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression())
!17 = distinct !DIGlobalVariable(name: "READ_CONTROL", scope: !15, file: !15, line: 59, type: !12, isLocal: true, isDefinition: true)
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(name: "WRITE_DAC", scope: !15, file: !15, line: 60, type: !12, isLocal: true, isDefinition: true)
!20 = !DIGlobalVariableExpression(var: !21, expr: !DIExpression())
!21 = distinct !DIGlobalVariable(name: "WRITE_OWNER", scope: !15, file: !15, line: 61, type: !12, isLocal: true, isDefinition: true)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(name: "SYNCHRONIZE", scope: !15, file: !15, line: 62, type: !12, isLocal: true, isDefinition: true)
!24 = distinct !DICompileUnit(language: DW_LANG_C99, file: !25, producer: "Apoc Compiler", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !26)
!25 = !DIFile(filename: "quick_test.apoc", directory: "E:\\C_Projects\\Apocalypse")
!26 = !{!0, !4, !6, !9, !13, !16, !18, !20, !22}
!27 = !{i32 2, !"Debug Info Version", i32 3}
!28 = !{i32 2, !"CodeView", i32 1}
!29 = distinct !DISubprogram(name: "give_num", scope: !30, file: !30, line: 2, type: !31, scopeLine: 2, spFlags: DISPFlagDefinition, unit: !24, retainedNodes: !34)
!30 = !DIFile(filename: "./quick_test_2.apoc", directory: "E:\\C_Projects\\Apocalypse")
!31 = !DISubroutineType(types: !32)
!32 = !{!33}
!33 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!34 = !{}
!35 = !DILocalVariable(name: "a", scope: !29, file: !30, line: 3, type: !33, align: 32)
!36 = !DILocation(line: 0, scope: !29)
!37 = !DILocation(line: 4, column: 5, scope: !29)
!38 = distinct !DISubprogram(name: "main", scope: !39, file: !39, line: 6, type: !31, scopeLine: 7, spFlags: DISPFlagDefinition, unit: !24, retainedNodes: !34)
!39 = !DIFile(filename: "./Test.apoc", directory: "E:\\C_Projects\\Apocalypse")
!40 = !DILocation(line: 15, column: 13, scope: !38)
!41 = !DILocation(line: 14, column: 13, scope: !38)
!42 = !DILocation(line: 12, column: 12, scope: !38)
!43 = !DILocation(line: 9, column: 7, scope: !38)
!44 = !DILocation(line: 16, column: 6, scope: !38)
!45 = distinct !DISubprogram(name: "mem_alloc", scope: !46, file: !46, line: 12, type: !47, scopeLine: 13, spFlags: DISPFlagDefinition, unit: !24, retainedNodes: !34)
!46 = !DIFile(filename: "./C_Standard.apoc", directory: "E:\\C_Projects\\Apocalypse\\Standard")
!47 = !DISubroutineType(types: !48)
!48 = !{!8, !49}
!49 = !DIBasicType(name: "u64", size: 32, encoding: DW_ATE_unsigned)
!50 = !DILocalVariable(name: "size", arg: 1, scope: !45, file: !46, line: 12, type: !49)
!51 = !DILocation(line: 0, scope: !45)
!52 = !DILocation(line: 14, column: 2, scope: !45)
!53 = !DILocalVariable(name: "result", scope: !45, file: !46, line: 14, type: !8, align: 64)
!54 = !DILocation(line: 15, column: 8, scope: !45)
!55 = !DILocation(line: 16, column: 5, scope: !45)
!56 = distinct !DISubprogram(name: "builder_to_string", scope: !11, file: !11, line: 17, type: !57, scopeLine: 18, spFlags: DISPFlagDefinition, unit: !24, retainedNodes: !34)
!57 = !DISubroutineType(types: !58)
!58 = !{null, !59}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "String_Builder", scope: !11, file: !11, line: 10, size: 2176, align: 2048, elements: !61)
!61 = !{!62, !67, !68}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !11, file: !11, line: 12, baseType: !63, size: 2048, align: 8)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 2048, align: 8, elements: !65)
!64 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!65 = !{!66}
!66 = !DISubrange(count: 256, lowerBound: 0)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !11, file: !11, line: 13, baseType: !12, size: 64, align: 64, offset: 2048)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !11, file: !11, line: 14, baseType: !59, size: 64, align: 64, offset: 2112)
!69 = !DILocalVariable(name: "builder", arg: 1, scope: !56, file: !11, line: 17, type: !59)
!70 = !DILocation(line: 0, scope: !56)
!71 = !DILocalVariable(name: "out", scope: !56, file: !11, line: 19, type: !72, align: 64)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", scope: !11, file: !11, line: 4, size: 128, align: 64, elements: !73)
!73 = !{!74, !76}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !11, file: !11, line: 6, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !11, file: !11, line: 7, baseType: !12, size: 64, align: 64, offset: 64)
!77 = !DILocalVariable(name: "out_len", scope: !56, file: !11, line: 20, type: !12, align: 64)
!78 = !DILocalVariable(name: "current", scope: !56, file: !11, line: 21, type: !59, align: 64)
!79 = !DILocalVariable(name: "i", scope: !56, file: !11, line: 22, type: !12, align: 64)
!80 = !DILocation(line: 22, column: 2, scope: !56)
!81 = !DILocation(line: 23, column: 3, scope: !56)
!82 = !DILocation(line: 26, column: 2, scope: !56)
!83 = !DILocation(line: 0, scope: !45, inlinedAt: !84)
!84 = distinct !DILocation(line: 27, column: 2, scope: !56)
!85 = !DILocation(line: 14, column: 2, scope: !45, inlinedAt: !84)
!86 = !DILocation(line: 15, column: 8, scope: !45, inlinedAt: !84)
!87 = !DILocalVariable(name: "times", scope: !56, file: !11, line: 30, type: !12, align: 64)
!88 = !DILocalVariable(name: "i", scope: !56, file: !11, line: 31, type: !12, align: 64)
!89 = !DILocation(line: 31, column: 2, scope: !56)
!90 = !DILocation(line: 249, column: 2, scope: !91, inlinedAt: !94)
!91 = distinct !DISubprogram(name: "copy", scope: !11, file: !11, line: 245, type: !92, scopeLine: 246, spFlags: DISPFlagDefinition, unit: !24, retainedNodes: !34)
!92 = !DISubroutineType(types: !93)
!93 = !{null, !8, !8, !49}
!94 = distinct !DILocation(line: 32, column: 7, scope: !56)
!95 = !DILocation(line: 32, column: 7, scope: !56)
!96 = !DILocalVariable(name: "dst", arg: 1, scope: !91, file: !11, line: 245, type: !8)
!97 = !DILocation(line: 0, scope: !91, inlinedAt: !94)
!98 = !DILocalVariable(name: "src", arg: 2, scope: !91, file: !11, line: 245, type: !8)
!99 = !DILocalVariable(name: "size", arg: 3, scope: !91, file: !11, line: 245, type: !49)
!100 = !DILocalVariable(name: "a0", scope: !91, file: !11, line: 247, type: !75, align: 64)
!101 = !DILocalVariable(name: "a1", scope: !91, file: !11, line: 248, type: !75, align: 64)
!102 = !DILocalVariable(name: "i", scope: !91, file: !11, line: 249, type: !12, align: 64)
!103 = !DILocation(line: 252, column: 2, scope: !91, inlinedAt: !94)
!104 = !DILocation(line: 251, column: 3, scope: !91, inlinedAt: !94)
!105 = distinct !{!105, !106}
!106 = !{!"llvm.loop.isvectorized", i32 1}
!107 = distinct !{!107, !106}
!108 = !DILocation(line: 33, column: 3, scope: !56)
!109 = !DILocation(line: 34, column: 3, scope: !56)
!110 = !DILocation(line: 36, column: 6, scope: !56)
!111 = !DILocation(line: 0, scope: !91, inlinedAt: !112)
!112 = distinct !DILocation(line: 36, column: 6, scope: !56)
!113 = !DILocation(line: 249, column: 2, scope: !91, inlinedAt: !112)
!114 = !DILocation(line: 252, column: 2, scope: !91, inlinedAt: !112)
!115 = !DILocation(line: 251, column: 3, scope: !91, inlinedAt: !112)
!116 = distinct !{!116, !106}
!117 = distinct !{!117, !106}
!118 = !DILocation(line: 38, column: 5, scope: !56)
!119 = distinct !DISubprogram(name: "init_builder", scope: !11, file: !11, line: 41, type: !120, scopeLine: 42, spFlags: DISPFlagDefinition, unit: !24, retainedNodes: !34)
!120 = !DISubroutineType(types: !121)
!121 = !{null, !75}
!122 = !DILocalVariable(name: "text", arg: 1, scope: !119, file: !11, line: 41, type: !75)
!123 = !DILocation(line: 0, scope: !119)
!124 = !DILocation(line: 43, column: 2, scope: !119)
!125 = !DILocalVariable(name: "out", scope: !119, file: !11, line: 43, type: !60, align: 2048)
!126 = !DILocalVariable(name: "current", scope: !119, file: !11, line: 44, type: !59, align: 64)
!127 = !DILocalVariable(name: "times", scope: !119, file: !11, line: 45, type: !12, align: 64)
!128 = !DILocalVariable(name: "i", scope: !119, file: !11, line: 46, type: !12, align: 64)
!129 = !DILocation(line: 46, column: 2, scope: !119)
!130 = !DILocation(line: 55, column: 2, scope: !119)
!131 = !DILocation(line: 47, column: 3, scope: !119)
!132 = !DILocation(line: 48, column: 3, scope: !119)
!133 = !DILocation(line: 49, column: 3, scope: !119)
!134 = !DILocation(line: 44, column: 2, scope: !119)
!135 = !DILocation(line: 56, column: 5, scope: !119)
!136 = !DILocation(line: 51, column: 4, scope: !119)
!137 = !DILocation(line: 0, scope: !45, inlinedAt: !138)
!138 = distinct !DILocation(line: 52, column: 4, scope: !119)
!139 = !DILocation(line: 14, column: 2, scope: !45, inlinedAt: !138)
!140 = !DILocation(line: 15, column: 8, scope: !45, inlinedAt: !138)
!141 = !DILocation(line: 52, column: 4, scope: !119)
!142 = !DILocation(line: 54, column: 3, scope: !119)
!143 = distinct !DISubprogram(name: "compare", scope: !11, file: !11, line: 111, type: !144, scopeLine: 112, spFlags: DISPFlagDefinition, unit: !24, retainedNodes: !34)
!144 = !DISubroutineType(types: !145)
!145 = !{!3, !72, !72}
!146 = !DILocalVariable(name: "str1", arg: 1, scope: !143, file: !11, line: 111, type: !72)
!147 = !DILocation(line: 0, scope: !143)
!148 = !DILocalVariable(name: "str2", arg: 2, scope: !143, file: !11, line: 111, type: !72)
!149 = !DILocation(line: 113, column: 2, scope: !143)
!150 = !DILocation(line: 116, column: 2, scope: !143)
!151 = !DILocalVariable(name: "i", scope: !143, file: !11, line: 116, type: !12, align: 64)
!152 = !DILocation(line: 117, column: 3, scope: !143)
!153 = distinct !DISubprogram(name: "to_string", scope: !11, file: !11, line: 121, type: !120, scopeLine: 122, spFlags: DISPFlagDefinition, unit: !24, retainedNodes: !34)
!154 = !DILocalVariable(name: "text", arg: 1, scope: !153, file: !11, line: 121, type: !75)
!155 = !DILocation(line: 0, scope: !153)
!156 = !DILocalVariable(name: "text", arg: 1, scope: !157, file: !11, line: 255, type: !75)
!157 = distinct !DISubprogram(name: "len", scope: !11, file: !11, line: 255, type: !158, scopeLine: 256, spFlags: DISPFlagDefinition, unit: !24, retainedNodes: !34)
!158 = !DISubroutineType(types: !159)
!159 = !{!12, !75}
!160 = !DILocation(line: 0, scope: !157, inlinedAt: !161)
!161 = distinct !DILocation(line: 123, column: 2, scope: !153)
!162 = !DILocalVariable(name: "result", scope: !157, file: !11, line: 257, type: !12, align: 64)
!163 = !DILocation(line: 258, column: 2, scope: !157, inlinedAt: !161)
!164 = !DILocalVariable(name: "text_len", scope: !153, file: !11, line: 123, type: !12, align: 64)
!165 = !DILocation(line: 0, scope: !45, inlinedAt: !166)
!166 = distinct !DILocation(line: 124, column: 2, scope: !153)
!167 = !DILocation(line: 14, column: 2, scope: !45, inlinedAt: !166)
!168 = !DILocation(line: 15, column: 8, scope: !45, inlinedAt: !166)
!169 = !DILocalVariable(name: "allocated", scope: !153, file: !11, line: 124, type: !8, align: 64)
!170 = !DILocation(line: 0, scope: !91, inlinedAt: !171)
!171 = distinct !DILocation(line: 125, column: 6, scope: !153)
!172 = !DILocation(line: 249, column: 2, scope: !91, inlinedAt: !171)
!173 = !DILocation(line: 251, column: 3, scope: !91, inlinedAt: !171)
!174 = !DILocation(line: 127, column: 5, scope: !153)
!175 = !DILocalVariable(name: "str", scope: !153, file: !11, line: 126, type: !72, align: 64)
!176 = distinct !DISubprogram(name: "terminate_string", scope: !11, file: !11, line: 130, type: !177, scopeLine: 131, spFlags: DISPFlagDefinition, unit: !24, retainedNodes: !34)
!177 = !DISubroutineType(types: !178)
!178 = !{null, !72}
!179 = !DILocalVariable(name: "str", arg: 1, scope: !176, file: !11, line: 130, type: !72)
!180 = !DILocation(line: 0, scope: !176)
!181 = !DILocalVariable(name: "out", scope: !176, file: !11, line: 132, type: !72, align: 64)
!182 = !DILocation(line: 133, column: 2, scope: !176)
!183 = !DILocation(line: 0, scope: !45, inlinedAt: !184)
!184 = distinct !DILocation(line: 134, column: 2, scope: !176)
!185 = !DILocation(line: 14, column: 2, scope: !45, inlinedAt: !184)
!186 = !DILocation(line: 15, column: 8, scope: !45, inlinedAt: !184)
!187 = !DILocation(line: 0, scope: !91, inlinedAt: !188)
!188 = distinct !DILocation(line: 135, column: 6, scope: !176)
!189 = !DILocation(line: 249, column: 2, scope: !91, inlinedAt: !188)
!190 = !DILocation(line: 252, column: 2, scope: !91, inlinedAt: !188)
!191 = !DILocation(line: 251, column: 3, scope: !91, inlinedAt: !188)
!192 = distinct !{!192, !106}
!193 = distinct !{!193, !106}
!194 = !DILocation(line: 136, column: 2, scope: !176)
!195 = !DILocation(line: 137, column: 5, scope: !176)
!196 = distinct !DISubprogram(name: "build_unsigned_int", scope: !11, file: !11, line: 140, type: !197, scopeLine: 140, spFlags: DISPFlagDefinition, unit: !24, retainedNodes: !34)
!197 = !DISubroutineType(types: !198)
!198 = !{null, !49, !12, !59}
!199 = !DILocalVariable(name: "num", arg: 1, scope: !196, file: !11, line: 140, type: !49)
!200 = !DILocation(line: 0, scope: !196)
!201 = !DILocalVariable(name: "num_size", arg: 2, scope: !196, file: !11, line: 140, type: !12)
!202 = !DILocalVariable(name: "builder", arg: 3, scope: !196, file: !11, line: 140, type: !59)
!203 = !DILocation(line: 141, column: 2, scope: !196)
!204 = !DILocation(line: 146, column: 1, scope: !196)
!205 = !DILocation(line: 143, column: 21, scope: !196)
!206 = !DILocalVariable(name: "digit", scope: !196, file: !11, line: 142, type: !49, align: 64)
!207 = !DILocation(line: 144, column: 4, scope: !196)
!208 = !DILocalVariable(name: "str", scope: !209, file: !11, line: 91, type: !59)
!209 = distinct !DISubprogram(name: "overload[x]=", scope: !11, file: !11, line: 91, type: !210, scopeLine: 92, spFlags: DISPFlagDefinition, unit: !24, retainedNodes: !34)
!210 = !DISubroutineType(types: !211)
!211 = !{null, !59, !64}
!212 = !DILocation(line: 0, scope: !209, inlinedAt: !213)
!213 = distinct !DILocation(line: 144, column: 4, scope: !196)
!214 = !DILocalVariable(name: "c", arg: 1, scope: !209, file: !11, line: 91, type: !64)
!215 = !DILocalVariable(name: "to_put", scope: !209, file: !11, line: 93, type: !59, align: 64)
!216 = !DILocation(line: 94, column: 2, scope: !209, inlinedAt: !213)
!217 = !DILocation(line: 100, column: 2, scope: !209, inlinedAt: !213)
!218 = !DILocation(line: 95, column: 3, scope: !209, inlinedAt: !213)
!219 = !DILocation(line: 0, scope: !45, inlinedAt: !220)
!220 = distinct !DILocation(line: 96, column: 4, scope: !209, inlinedAt: !213)
!221 = !DILocation(line: 14, column: 2, scope: !45, inlinedAt: !220)
!222 = !DILocation(line: 15, column: 8, scope: !45, inlinedAt: !220)
!223 = !DILocation(line: 96, column: 4, scope: !209, inlinedAt: !213)
!224 = !DILocation(line: 97, column: 3, scope: !209, inlinedAt: !213)
!225 = !DILocation(line: 98, column: 3, scope: !209, inlinedAt: !213)
!226 = !DILocation(line: 99, column: 4, scope: !209, inlinedAt: !213)
!227 = !DILocation(line: 101, column: 2, scope: !209, inlinedAt: !213)
!228 = !DILocation(line: 102, column: 2, scope: !209, inlinedAt: !213)
!229 = !DILocation(line: 145, column: 2, scope: !196)
!230 = distinct !DISubprogram(name: "int_to_str", scope: !11, file: !11, line: 148, type: !231, scopeLine: 149, spFlags: DISPFlagDefinition, unit: !24, retainedNodes: !34)
!231 = !DISubroutineType(types: !232)
!232 = !{null, !12, !59}
!233 = !DILocalVariable(name: "num", arg: 1, scope: !230, file: !11, line: 148, type: !12)
!234 = !DILocation(line: 0, scope: !230)
!235 = !DILocalVariable(name: "builder", arg: 2, scope: !230, file: !11, line: 148, type: !59)
!236 = !DILocation(line: 150, column: 2, scope: !230)
!237 = !DILocation(line: 157, column: 2, scope: !230)
!238 = !DILocation(line: 0, scope: !209, inlinedAt: !239)
!239 = distinct !DILocation(line: 151, column: 4, scope: !230)
!240 = !DILocation(line: 94, column: 2, scope: !209, inlinedAt: !239)
!241 = !DILocation(line: 100, column: 2, scope: !209, inlinedAt: !239)
!242 = !DILocation(line: 95, column: 3, scope: !209, inlinedAt: !239)
!243 = !DILocation(line: 0, scope: !45, inlinedAt: !244)
!244 = distinct !DILocation(line: 96, column: 4, scope: !209, inlinedAt: !239)
!245 = !DILocation(line: 14, column: 2, scope: !45, inlinedAt: !244)
!246 = !DILocation(line: 15, column: 8, scope: !45, inlinedAt: !244)
!247 = !DILocation(line: 96, column: 4, scope: !209, inlinedAt: !239)
!248 = !DILocation(line: 97, column: 3, scope: !209, inlinedAt: !239)
!249 = !DILocation(line: 98, column: 3, scope: !209, inlinedAt: !239)
!250 = !DILocation(line: 99, column: 4, scope: !209, inlinedAt: !239)
!251 = !DILocation(line: 101, column: 2, scope: !209, inlinedAt: !239)
!252 = !DILocation(line: 102, column: 2, scope: !209, inlinedAt: !239)
!253 = !DILocalVariable(name: "num_size", scope: !230, file: !11, line: 155, type: !12, align: 64)
!254 = !DILocalVariable(name: "div_copy", scope: !230, file: !11, line: 154, type: !12, align: 64)
!255 = !DILocation(line: 158, column: 3, scope: !230)
!256 = !DILocation(line: 160, column: 2, scope: !230)
!257 = !DILocation(line: 166, column: 1, scope: !230)
!258 = !DILocation(line: 0, scope: !209, inlinedAt: !259)
!259 = distinct !DILocation(line: 161, column: 4, scope: !230)
!260 = !DILocation(line: 94, column: 2, scope: !209, inlinedAt: !259)
!261 = !DILocation(line: 100, column: 2, scope: !209, inlinedAt: !259)
!262 = !DILocation(line: 95, column: 3, scope: !209, inlinedAt: !259)
!263 = !DILocation(line: 0, scope: !45, inlinedAt: !264)
!264 = distinct !DILocation(line: 96, column: 4, scope: !209, inlinedAt: !259)
!265 = !DILocation(line: 14, column: 2, scope: !45, inlinedAt: !264)
!266 = !DILocation(line: 15, column: 8, scope: !45, inlinedAt: !264)
!267 = !DILocation(line: 96, column: 4, scope: !209, inlinedAt: !259)
!268 = !DILocation(line: 97, column: 3, scope: !209, inlinedAt: !259)
!269 = !DILocation(line: 98, column: 3, scope: !209, inlinedAt: !259)
!270 = !DILocation(line: 99, column: 4, scope: !209, inlinedAt: !259)
!271 = !DILocation(line: 101, column: 2, scope: !209, inlinedAt: !259)
!272 = !DILocation(line: 102, column: 2, scope: !209, inlinedAt: !259)
!273 = !DILocation(line: 162, column: 3, scope: !230)
!274 = !DILocation(line: 164, column: 2, scope: !230)
!275 = !DILocation(line: 165, column: 20, scope: !230)
!276 = distinct !DISubprogram(name: "float_to_str", scope: !11, file: !11, line: 168, type: !277, scopeLine: 169, spFlags: DISPFlagDefinition, unit: !24, retainedNodes: !34)
!277 = !DISubroutineType(types: !278)
!278 = !{null, !279, !59}
!279 = !DIBasicType(name: "f64", size: 64, encoding: DW_ATE_float)
!280 = !DILocalVariable(name: "num", arg: 1, scope: !276, file: !11, line: 168, type: !279)
!281 = !DILocation(line: 0, scope: !276)
!282 = !DILocalVariable(name: "builder", arg: 2, scope: !276, file: !11, line: 168, type: !59)
!283 = !DILocation(line: 170, column: 2, scope: !276)
!284 = !DILocation(line: 185, column: 2, scope: !276)
!285 = !DILocation(line: 0, scope: !209, inlinedAt: !286)
!286 = distinct !DILocation(line: 171, column: 4, scope: !276)
!287 = !DILocation(line: 94, column: 2, scope: !209, inlinedAt: !286)
!288 = !DILocation(line: 100, column: 2, scope: !209, inlinedAt: !286)
!289 = !DILocation(line: 95, column: 3, scope: !209, inlinedAt: !286)
!290 = !DILocation(line: 0, scope: !45, inlinedAt: !291)
!291 = distinct !DILocation(line: 96, column: 4, scope: !209, inlinedAt: !286)
!292 = !DILocation(line: 14, column: 2, scope: !45, inlinedAt: !291)
!293 = !DILocation(line: 15, column: 8, scope: !45, inlinedAt: !291)
!294 = !DILocation(line: 96, column: 4, scope: !209, inlinedAt: !286)
!295 = !DILocation(line: 97, column: 3, scope: !209, inlinedAt: !286)
!296 = !DILocation(line: 98, column: 3, scope: !209, inlinedAt: !286)
!297 = !DILocation(line: 99, column: 4, scope: !209, inlinedAt: !286)
!298 = !DILocation(line: 101, column: 2, scope: !209, inlinedAt: !286)
!299 = !DILocation(line: 102, column: 2, scope: !209, inlinedAt: !286)
!300 = !DILocation(line: 172, column: 3, scope: !276)
!301 = !DILocation(line: 173, column: 2, scope: !276)
!302 = !DILocation(line: 175, column: 2, scope: !276)
!303 = !DILocalVariable(name: "decimal", scope: !276, file: !11, line: 175, type: !49, align: 64)
!304 = !DILocation(line: 176, column: 2, scope: !276)
!305 = !DILocation(line: 178, column: 2, scope: !276)
!306 = !DILocation(line: 0, scope: !209, inlinedAt: !307)
!307 = distinct !DILocation(line: 179, column: 4, scope: !276)
!308 = !DILocation(line: 94, column: 2, scope: !209, inlinedAt: !307)
!309 = !DILocation(line: 100, column: 2, scope: !209, inlinedAt: !307)
!310 = !DILocation(line: 95, column: 3, scope: !209, inlinedAt: !307)
!311 = !DILocation(line: 0, scope: !45, inlinedAt: !312)
!312 = distinct !DILocation(line: 96, column: 4, scope: !209, inlinedAt: !307)
!313 = !DILocation(line: 14, column: 2, scope: !45, inlinedAt: !312)
!314 = !DILocation(line: 15, column: 8, scope: !45, inlinedAt: !312)
!315 = !DILocation(line: 96, column: 4, scope: !209, inlinedAt: !307)
!316 = !DILocation(line: 97, column: 3, scope: !209, inlinedAt: !307)
!317 = !DILocation(line: 98, column: 3, scope: !209, inlinedAt: !307)
!318 = !DILocation(line: 99, column: 4, scope: !209, inlinedAt: !307)
!319 = !DILocation(line: 101, column: 2, scope: !209, inlinedAt: !307)
!320 = !DILocation(line: 102, column: 2, scope: !209, inlinedAt: !307)
!321 = !DILocation(line: 180, column: 2, scope: !276)
!322 = !DILocation(line: 0, scope: !209, inlinedAt: !323)
!323 = distinct !DILocation(line: 182, column: 3, scope: !276)
!324 = !DILocation(line: 94, column: 2, scope: !209, inlinedAt: !323)
!325 = !DILocation(line: 100, column: 2, scope: !209, inlinedAt: !323)
!326 = !DILocation(line: 95, column: 3, scope: !209, inlinedAt: !323)
!327 = !DILocation(line: 0, scope: !45, inlinedAt: !328)
!328 = distinct !DILocation(line: 96, column: 4, scope: !209, inlinedAt: !323)
!329 = !DILocation(line: 14, column: 2, scope: !45, inlinedAt: !328)
!330 = !DILocation(line: 15, column: 8, scope: !45, inlinedAt: !328)
!331 = !DILocation(line: 96, column: 4, scope: !209, inlinedAt: !323)
!332 = !DILocation(line: 97, column: 3, scope: !209, inlinedAt: !323)
!333 = !DILocation(line: 98, column: 3, scope: !209, inlinedAt: !323)
!334 = !DILocation(line: 99, column: 4, scope: !209, inlinedAt: !323)
!335 = !DILocation(line: 101, column: 2, scope: !209, inlinedAt: !323)
!336 = !DILocation(line: 102, column: 2, scope: !209, inlinedAt: !323)
!337 = !DILocalVariable(name: "zeroes_to_append", scope: !276, file: !11, line: 183, type: !12, align: 64)
!338 = !DILocation(line: 181, column: 17, scope: !276)
!339 = !DILocation(line: 181, column: 2, scope: !276)
!340 = !DILocalVariable(name: "i", scope: !276, file: !11, line: 190, type: !12, align: 64)
!341 = !DILocation(line: 190, column: 2, scope: !276)
!342 = !DILocation(line: 94, column: 2, scope: !209, inlinedAt: !343)
!343 = distinct !DILocation(line: 191, column: 4, scope: !276)
!344 = !DILocation(line: 186, column: 3, scope: !276)
!345 = !DILocation(line: 187, column: 3, scope: !276)
!346 = !DILocation(line: 188, column: 2, scope: !276)
!347 = !DILocation(line: 0, scope: !209, inlinedAt: !343)
!348 = !DILocation(line: 100, column: 2, scope: !209, inlinedAt: !343)
!349 = !DILocation(line: 95, column: 3, scope: !209, inlinedAt: !343)
!350 = !DILocation(line: 0, scope: !45, inlinedAt: !351)
!351 = distinct !DILocation(line: 96, column: 4, scope: !209, inlinedAt: !343)
!352 = !DILocation(line: 14, column: 2, scope: !45, inlinedAt: !351)
!353 = !DILocation(line: 15, column: 8, scope: !45, inlinedAt: !351)
!354 = !DILocation(line: 96, column: 4, scope: !209, inlinedAt: !343)
!355 = !DILocation(line: 97, column: 3, scope: !209, inlinedAt: !343)
!356 = !DILocation(line: 98, column: 3, scope: !209, inlinedAt: !343)
!357 = !DILocation(line: 99, column: 4, scope: !209, inlinedAt: !343)
!358 = !DILocation(line: 101, column: 2, scope: !209, inlinedAt: !343)
!359 = !DILocation(line: 102, column: 2, scope: !209, inlinedAt: !343)
!360 = !DILocation(line: 192, column: 2, scope: !276)
!361 = !DILocation(line: 194, column: 12, scope: !276)
!362 = !DILocation(line: 195, column: 1, scope: !276)
!363 = distinct !DISubprogram(name: "parse_format", scope: !11, file: !11, line: 197, type: !364, scopeLine: 198, spFlags: DISPFlagDefinition, unit: !24, retainedNodes: !34)
!364 = !DISubroutineType(types: !365)
!365 = !{null, !72, !366}
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "Any", scope: !2, file: !2, line: 51, size: 128, align: 64, elements: !368)
!368 = !{!369, !424}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !2, file: !2, line: 52, baseType: !370, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Info", scope: !2, file: !2, line: 56, size: 320, align: 64, elements: !372)
!372 = !{!373, !374, !379, !392, !400, !407, !415}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !2, file: !2, line: 57, baseType: !33, size: 32, align: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "primitive", scope: !2, file: !2, line: 66, baseType: !375, size: 64, align: 32)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Primitive", scope: !2, file: !2, line: 66, size: 64, align: 32, elements: !376)
!376 = !{!377, !378}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !2, file: !2, line: 67, baseType: !33, size: 32, align: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2, file: !2, line: 68, baseType: !33, size: 32, align: 32, offset: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !2, file: !2, line: 71, baseType: !380, size: 320, align: 64)
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Struct", scope: !2, file: !2, line: 71, size: 320, align: 64, elements: !381)
!381 = !{!382, !383, !384, !385, !386, !387, !389}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !2, file: !2, line: 72, baseType: !33, size: 32, align: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "member_count", scope: !2, file: !2, line: 73, baseType: !33, size: 32, align: 32, offset: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "is_union", scope: !2, file: !2, line: 74, baseType: !3, size: 8, align: 8, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "is_packed", scope: !2, file: !2, line: 75, baseType: !3, size: 8, align: 8, offset: 72)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2, file: !2, line: 76, baseType: !75, size: 64, align: 64, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "member_names", scope: !2, file: !2, line: 77, baseType: !388, size: 64, align: 64, offset: 192)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "member_types", scope: !2, file: !2, line: 78, baseType: !390, size: 64, align: 64, offset: 256)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Info", scope: !2, file: !2, line: 78, size: 320, align: 64, elements: !372)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !2, file: !2, line: 81, baseType: !393, size: 192, align: 64)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Array", scope: !2, file: !2, line: 81, size: 192, align: 64, elements: !394)
!394 = !{!395, !396, !399}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !2, file: !2, line: 82, baseType: !33, size: 32, align: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !2, file: !2, line: 83, baseType: !397, size: 64, align: 64, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Info", scope: !2, file: !2, line: 83, size: 320, align: 64, elements: !372)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "elem_count", scope: !2, file: !2, line: 84, baseType: !49, size: 64, align: 64, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !2, file: !2, line: 87, baseType: !401, size: 128, align: 64)
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Pointer", scope: !2, file: !2, line: 87, size: 128, align: 64, elements: !402)
!402 = !{!403, !404}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !2, file: !2, line: 88, baseType: !33, size: 32, align: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "pointed", scope: !2, file: !2, line: 89, baseType: !405, size: 64, align: 64, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Info", scope: !2, file: !2, line: 89, size: 320, align: 64, elements: !372)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "enumerator", scope: !2, file: !2, line: 92, baseType: !408, size: 256, align: 64)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Enum", scope: !2, file: !2, line: 92, size: 256, align: 64, elements: !409)
!409 = !{!410, !411, !412, !413}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !2, file: !2, line: 93, baseType: !33, size: 32, align: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !2, file: !2, line: 94, baseType: !375, size: 64, align: 32, offset: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "names", scope: !2, file: !2, line: 95, baseType: !388, size: 64, align: 64, offset: 128)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !2, file: !2, line: 96, baseType: !414, size: 64, align: 64, offset: 192)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !2, file: !2, line: 99, baseType: !416, size: 256, align: 64)
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Func", scope: !2, file: !2, line: 99, size: 256, align: 64, elements: !417)
!417 = !{!418, !419, !422, !423}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !2, file: !2, line: 100, baseType: !33, size: 32, align: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "param_types", scope: !2, file: !2, line: 101, baseType: !420, size: 64, align: 64, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Info", scope: !2, file: !2, line: 101, size: 320, align: 64, elements: !372)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "return_type", scope: !2, file: !2, line: 102, baseType: !420, size: 64, align: 64, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "calling_convention", scope: !2, file: !2, line: 103, baseType: !33, size: 32, align: 32, offset: 192)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !2, file: !2, line: 53, baseType: !8, size: 64, align: 64, offset: 64)
!425 = !DILocalVariable(name: "format", arg: 1, scope: !363, file: !11, line: 197, type: !72)
!426 = !DILocation(line: 0, scope: !363)
!427 = !DILocalVariable(name: "list", arg: 2, scope: !363, file: !11, line: 197, type: !366)
!428 = !DILocation(line: 199, column: 2, scope: !363)
!429 = !DILocalVariable(name: "builder", scope: !363, file: !11, line: 199, type: !60, align: 2048)
!430 = !DILocalVariable(name: "list_index", scope: !363, file: !11, line: 200, type: !12, align: 64)
!431 = !DILocalVariable(name: "i", scope: !363, file: !11, line: 201, type: !12, align: 64)
!432 = !DILocalVariable(name: "item", scope: !363, file: !11, line: 203, type: !367, align: 64)
!433 = !DILocation(line: 201, column: 2, scope: !363)
!434 = !DILocalVariable(name: "str", scope: !435, file: !11, line: 59, type: !72)
!435 = distinct !DISubprogram(name: "overload[]", scope: !11, file: !11, line: 59, type: !436, scopeLine: 60, spFlags: DISPFlagDefinition, unit: !24, retainedNodes: !34)
!436 = !DISubroutineType(types: !437)
!437 = !{!64, !72, !12}
!438 = !DILocation(line: 0, scope: !435, inlinedAt: !439)
!439 = distinct !DILocation(line: 202, column: 3, scope: !363)
!440 = !DILocalVariable(name: "index", arg: 1, scope: !435, file: !11, line: 59, type: !12)
!441 = !DILocation(line: 61, column: 5, scope: !435, inlinedAt: !439)
!442 = !DILocation(line: 202, column: 3, scope: !363)
!443 = !DILocation(line: 217, column: 2, scope: !363)
!444 = !DILocation(line: 0, scope: !209, inlinedAt: !445)
!445 = distinct !DILocation(line: 218, column: 2, scope: !363)
!446 = !DILocation(line: 94, column: 2, scope: !209, inlinedAt: !445)
!447 = !DILocation(line: 100, column: 2, scope: !209, inlinedAt: !445)
!448 = !DILocation(line: 95, column: 3, scope: !209, inlinedAt: !445)
!449 = !DILocation(line: 0, scope: !45, inlinedAt: !450)
!450 = distinct !DILocation(line: 96, column: 4, scope: !209, inlinedAt: !445)
!451 = !DILocation(line: 14, column: 2, scope: !45, inlinedAt: !450)
!452 = !DILocation(line: 15, column: 8, scope: !45, inlinedAt: !450)
!453 = !DILocation(line: 96, column: 4, scope: !209, inlinedAt: !445)
!454 = !DILocation(line: 97, column: 3, scope: !209, inlinedAt: !445)
!455 = !DILocation(line: 98, column: 3, scope: !209, inlinedAt: !445)
!456 = !DILocation(line: 99, column: 4, scope: !209, inlinedAt: !445)
!457 = !DILocation(line: 101, column: 2, scope: !209, inlinedAt: !445)
!458 = !DILocation(line: 102, column: 2, scope: !209, inlinedAt: !445)
!459 = !DILocalVariable(name: "out", scope: !363, file: !11, line: 219, type: !72, align: 64)
!460 = !DILocation(line: 0, scope: !56, inlinedAt: !461)
!461 = distinct !DILocation(line: 219, column: 2, scope: !363)
!462 = !DILocation(line: 22, column: 2, scope: !56, inlinedAt: !461)
!463 = !DILocation(line: 23, column: 3, scope: !56, inlinedAt: !461)
!464 = !DILocation(line: 26, column: 2, scope: !56, inlinedAt: !461)
!465 = !DILocation(line: 0, scope: !45, inlinedAt: !466)
!466 = distinct !DILocation(line: 27, column: 2, scope: !56, inlinedAt: !461)
!467 = !DILocation(line: 14, column: 2, scope: !45, inlinedAt: !466)
!468 = !DILocation(line: 15, column: 8, scope: !45, inlinedAt: !466)
!469 = !DILocation(line: 31, column: 2, scope: !56, inlinedAt: !461)
!470 = !DILocation(line: 249, column: 2, scope: !91, inlinedAt: !471)
!471 = distinct !DILocation(line: 32, column: 7, scope: !56, inlinedAt: !461)
!472 = !DILocation(line: 32, column: 7, scope: !56, inlinedAt: !461)
!473 = !DILocation(line: 0, scope: !91, inlinedAt: !471)
!474 = !DILocation(line: 252, column: 2, scope: !91, inlinedAt: !471)
!475 = !DILocation(line: 251, column: 3, scope: !91, inlinedAt: !471)
!476 = distinct !{!476, !106}
!477 = distinct !{!477, !106}
!478 = !DILocation(line: 33, column: 3, scope: !56, inlinedAt: !461)
!479 = !DILocation(line: 34, column: 3, scope: !56, inlinedAt: !461)
