; ModuleID = 'Test.apoc'
source_filename = "Test.apoc"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%Any = type { ptr, ptr }
%Type_Info = type { %Type_Struct.1 }
%Type_Struct.1 = type { i32, i32, i8, i8, ptr, ptr, ptr }
%__Internal_Context = type { ptr }
%string = type { ptr, i64 }
%String_Builder = type { [256 x i8], i64, ptr }
%Type_Primitive.2 = type { i32, i32 }

@global_var = constant i8 1, !dbg !0
@global_var.1 = constant i8 0, !dbg !4
@global_var.2 = constant ptr null, !dbg !6
@global_var.3 = constant i64 256, !dbg !10
@global_var.4 = constant i64 65536, !dbg !14
@global_var.5 = constant i64 131072, !dbg !17
@global_var.6 = constant i64 262144, !dbg !19
@global_var.7 = constant i64 524288, !dbg !21
@global_var.8 = constant i64 1048576, !dbg !23
@0 = private unnamed_addr constant [14 x i8] c"my big string\00", align 1
@1 = private unnamed_addr constant [13 x i8] c" more text %\00", align 1
@2 = private unnamed_addr constant [10 x i8] c"Number: %\00", align 1
@3 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1

declare void @var_arg_start(ptr, ptr)

declare void @var_arg_stop(ptr, ptr)

define i32 @main(ptr %__apoc_internal_context) !dbg !37 {
entry:
  %to_any9 = alloca %Any, align 16
  %any_val8 = alloca i64, align 8
  %runtime_type_info7 = alloca %Type_Info, align 16
  %__apoc_internal_context6 = alloca %__Internal_Context, align 16

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "true", scope: !2, file: !2, line: 2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "Basic.apoc", directory: "W:\\Apocalypse\\Standard")
!3 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "false", scope: !2, file: !2, line: 3, type: !3, isLocal: true, isDefinition: true)
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "null", scope: !2, file: !2, line: 4, type: !8, isLocal: true, isDefinition: true)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIBasicType(tag: DW_TAG_unspecified_type, name: "void")
!10 = !DIGlobalVariableExpression(var: !11, expr: !DIExpression())
!11 = distinct !DIGlobalVariable(name: "STRING_BUFFER_SIZE", scope: !12, file: !12, line: 2, type: !13, isLocal: true, isDefinition: true)
!12 = !DIFile(filename: "String.apoc", directory: "W:\\Apocalypse\\Standard")
!13 = !DIBasicType(name: "i64", size: 64, encoding: DW_ATE_signed)
!14 = !DIGlobalVariableExpression(var: !15, expr: !DIExpression())
!15 = distinct !DIGlobalVariable(name: "DELETE", scope: !16, file: !16, line: 58, type: !13, isLocal: true, isDefinition: true)
!16 = !DIFile(filename: "Windows.apoc", directory: "W:\\Apocalypse\\Standard")
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(name: "READ_CONTROL", scope: !16, file: !16, line: 59, type: !13, isLocal: true, isDefinition: true)
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(name: "WRITE_DAC", scope: !16, file: !16, line: 60, type: !13, isLocal: true, isDefinition: true)
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(name: "WRITE_OWNER", scope: !16, file: !16, line: 61, type: !13, isLocal: true, isDefinition: true)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "SYNCHRONIZE", scope: !16, file: !16, line: 62, type: !13, isLocal: true, isDefinition: true)
!25 = distinct !DICompileUnit(language: DW_LANG_C99, file: !26, producer: "Apoc Compiler", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug)
!26 = !DIFile(filename: "Test.apoc", directory: "W:\\Apocalypse")
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !2, producer: "Apoc Compiler", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug)
!28 = distinct !DICompileUnit(language: DW_LANG_C99, file: !29, producer: "Apoc Compiler", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug)
!29 = !DIFile(filename: "C_Standard.apoc", directory: "W:\\Apocalypse\\Standard")
!30 = distinct !DICompileUnit(language: DW_LANG_C99, file: !31, producer: "Apoc Compiler", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug)
!31 = !DIFile(filename: "OS.apoc", directory: "W:\\Apocalypse\\Standard")
!32 = distinct !DICompileUnit(language: DW_LANG_C99, file: !12, producer: "Apoc Compiler", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug)
!33 = distinct !DICompileUnit(language: DW_LANG_C99, file: !16, producer: "Apoc Compiler", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !34)
!34 = !{!0, !4, !6, !10, !14, !17, !19, !21, !23}
!35 = !{i32 2, !"Debug Info Version", i32 3}
!36 = !{i32 2, !"CodeView", i32 1}
!37 = distinct !DISubprogram(name: "main", scope: !26, file: !26, line: 5, type: !38, scopeLine: 6, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !33, retainedNodes: !41)
!38 = !DISubroutineType(types: !39)
!39 = !{!40}
!40 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!41 = !{}
!42 = !DILocation(line: 7, column: 2, scope: !37)
!43 = !DILocalVariable(name: "result", scope: !37, file: !26, line: 7, type: !44, align: 128)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "String_Builder", scope: !12, file: !12, line: 10, size: 2176, align: 2048, elements: !45)
!45 = !{!46, !51, !52}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !12, file: !12, line: 12, baseType: !47, size: 2048, align: 128)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 2048, align: 8, elements: !49)
!48 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!49 = !{!50}
!50 = !DISubrange(count: 256, lowerBound: 0)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !12, file: !12, line: 13, baseType: !13, size: 64, align: 64, offset: 2048)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !12, file: !12, line: 14, baseType: !53, size: 64, align: 64, offset: 2112)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!54 = !DILocation(line: 8, column: 2, scope: !37)
!55 = !DILocation(line: 9, column: 2, scope: !37)
!56 = !DILocalVariable(name: "str", scope: !37, file: !26, line: 9, type: !57, align: 128)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", scope: !12, file: !12, line: 4, size: 128, align: 64, elements: !58)
!58 = !{!59, !61}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !12, file: !12, line: 6, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !12, file: !12, line: 7, baseType: !13, size: 64, align: 64, offset: 64)
!62 = !DILocation(line: 11, column: 7, scope: !37)
!63 = !DILocation(line: 12, column: 7, scope: !37)
!64 = !DILocation(line: 13, column: 5, scope: !37)
!65 = distinct !DISubprogram(name: "mem_alloc", scope: !29, file: !29, line: 12, type: !66, scopeLine: 13, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !33, retainedNodes: !41)
!66 = !DISubroutineType(types: !67)
!67 = !{!8, !68}
!68 = !DIBasicType(name: "u64", size: 32, encoding: DW_ATE_unsigned)
!69 = !DILocalVariable(name: "size", arg: 1, scope: !65, file: !29, line: 12, type: !68)
!70 = !DILocation(line: 12, scope: !65)
!71 = !DILocation(line: 14, column: 2, scope: !65)
!72 = !DILocalVariable(name: "result", scope: !65, file: !29, line: 14, type: !8, align: 64)
!73 = !DILocation(line: 15, column: 8, scope: !65)
!74 = !DILocation(line: 16, column: 5, scope: !65)
!75 = distinct !DISubprogram(name: "builder_to_string", scope: !12, file: !12, line: 17, type: !76, scopeLine: 18, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !33, retainedNodes: !41)
!76 = !DISubroutineType(types: !77)
!77 = !{!9, !53}
!78 = !DILocalVariable(name: "builder", arg: 1, scope: !75, file: !12, line: 17, type: !53)
!79 = !DILocation(line: 17, scope: !75)
!80 = !DILocation(line: 19, column: 2, scope: !75)
!81 = !DILocalVariable(name: "out", scope: !75, file: !12, line: 19, type: !57, align: 128)
!82 = !DILocation(line: 20, column: 2, scope: !75)
!83 = !DILocalVariable(name: "out_len", scope: !75, file: !12, line: 20, type: !13, align: 64)
!84 = !DILocation(line: 21, column: 2, scope: !75)
!85 = !DILocalVariable(name: "current", scope: !75, file: !12, line: 21, type: !53, align: 64)
!86 = !DILocation(line: 22, column: 2, scope: !75)
!87 = !DILocalVariable(name: "i", scope: !75, file: !12, line: 22, type: !13, align: 64)
!88 = !DILocation(line: 22, column: 6, scope: !75)
!89 = !DILocation(line: 23, column: 3, scope: !75)
!90 = !DILocation(line: 24, column: 3, scope: !75)
!91 = !DILocation(line: 25, column: 2, scope: !75)
!92 = !DILocation(line: 26, column: 2, scope: !75)
!93 = !DILocation(line: 27, column: 2, scope: !75)
!94 = !DILocation(line: 28, column: 2, scope: !75)
!95 = !DILocation(line: 30, column: 2, scope: !75)
!96 = !DILocalVariable(name: "times", scope: !75, file: !12, line: 30, type: !13, align: 64)
!97 = !DILocation(line: 31, column: 2, scope: !75)
!98 = !DILocalVariable(name: "i", scope: !75, file: !12, line: 31, type: !13, align: 64)
!99 = !DILocation(line: 31, column: 6, scope: !75)
!100 = !DILocation(line: 32, column: 7, scope: !75)
!101 = !DILocation(line: 33, column: 3, scope: !75)
!102 = !DILocation(line: 34, column: 3, scope: !75)
!103 = !DILocation(line: 35, column: 2, scope: !75)
!104 = !DILocation(line: 36, column: 6, scope: !75)
!105 = !DILocation(line: 37, column: 2, scope: !75)
!106 = !DILocation(line: 38, column: 5, scope: !75)
!107 = distinct !DISubprogram(name: "init_builder", scope: !12, file: !12, line: 41, type: !108, scopeLine: 42, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !33, retainedNodes: !41)
!108 = !DISubroutineType(types: !109)
!109 = !{!9, !60}
!110 = !DILocalVariable(name: "text", arg: 1, scope: !107, file: !12, line: 41, type: !60)
!111 = !DILocation(line: 41, scope: !107)
!112 = !DILocation(line: 43, column: 2, scope: !107)
!113 = !DILocalVariable(name: "out", scope: !107, file: !12, line: 43, type: !44, align: 128)
!114 = !DILocation(line: 44, column: 2, scope: !107)
!115 = !DILocalVariable(name: "current", scope: !107, file: !12, line: 44, type: !53, align: 64)
!116 = !DILocation(line: 45, column: 2, scope: !107)
!117 = !DILocalVariable(name: "times", scope: !107, file: !12, line: 45, type: !13, align: 64)
!118 = !DILocation(line: 46, column: 2, scope: !107)
!119 = !DILocalVariable(name: "i", scope: !107, file: !12, line: 46, type: !13, align: 64)
!120 = !DILocation(line: 46, column: 6, scope: !107)
!121 = !DILocation(line: 47, column: 3, scope: !107)
!122 = !DILocation(line: 48, column: 3, scope: !107)
!123 = !DILocation(line: 49, column: 3, scope: !107)
!124 = !DILocation(line: 55, column: 2, scope: !107)
!125 = !DILocation(line: 56, column: 5, scope: !107)
!126 = !DILocation(line: 50, column: 4, scope: !107)
!127 = !DILocation(line: 51, column: 4, scope: !107)
!128 = !DILocation(line: 52, column: 4, scope: !107)
!129 = !DILocation(line: 53, column: 4, scope: !107)
!130 = !DILocation(line: 54, column: 3, scope: !107)
!131 = distinct !DISubprogram(name: "compare", scope: !12, file: !12, line: 111, type: !132, scopeLine: 112, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !33, retainedNodes: !41)
!132 = !DISubroutineType(types: !133)
!133 = !{!3, !57, !57}
!134 = !DILocalVariable(name: "str1", arg: 1, scope: !131, file: !12, line: 111, type: !57)
!135 = !DILocation(line: 111, scope: !131)
!136 = !DILocalVariable(name: "str2", arg: 2, scope: !131, file: !12, line: 111, type: !57)
!137 = !DILocation(line: 113, column: 2, scope: !131)
!138 = !DILocation(line: 116, column: 2, scope: !131)
!139 = !DILocation(line: 114, column: 6, scope: !131)
!140 = !DILocalVariable(name: "i", scope: !131, file: !12, line: 116, type: !13, align: 64)
!141 = !DILocation(line: 116, column: 6, scope: !131)
!142 = !DILocation(line: 117, column: 3, scope: !131)
!143 = !DILocation(line: 118, column: 5, scope: !131)
!144 = !DILocation(line: 117, column: 38, scope: !131)
!145 = distinct !DISubprogram(name: "to_string", scope: !12, file: !12, line: 121, type: !108, scopeLine: 122, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !33, retainedNodes: !41)
!146 = !DILocalVariable(name: "text", arg: 1, scope: !145, file: !12, line: 121, type: !60)
!147 = !DILocation(line: 121, scope: !145)
!148 = !DILocation(line: 123, column: 2, scope: !145)
!149 = !DILocalVariable(name: "text_len", scope: !145, file: !12, line: 123, type: !13, align: 64)
!150 = !DILocation(line: 124, column: 2, scope: !145)
!151 = !DILocalVariable(name: "allocated", scope: !145, file: !12, line: 124, type: !8, align: 64)
!152 = !DILocation(line: 125, column: 6, scope: !145)
!153 = !DILocation(line: 126, column: 2, scope: !145)
!154 = !DILocalVariable(name: "str", scope: !145, file: !12, line: 126, type: !57, align: 128)
!155 = !DILocation(line: 127, column: 5, scope: !145)
!156 = distinct !DISubprogram(name: "terminate_string", scope: !12, file: !12, line: 130, type: !157, scopeLine: 131, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !33, retainedNodes: !41)
!157 = !DISubroutineType(types: !158)
!158 = !{!9, !57}
!159 = !DILocalVariable(name: "str", arg: 1, scope: !156, file: !12, line: 130, type: !57)
!160 = !DILocation(line: 130, scope: !156)
!161 = !DILocation(line: 132, column: 2, scope: !156)
!162 = !DILocalVariable(name: "out", scope: !156, file: !12, line: 132, type: !57, align: 128)
!163 = !DILocation(line: 133, column: 2, scope: !156)
!164 = !DILocation(line: 134, column: 2, scope: !156)
!165 = !DILocation(line: 135, column: 6, scope: !156)
!166 = !DILocation(line: 136, column: 2, scope: !156)
!167 = !DILocation(line: 137, column: 5, scope: !156)
!168 = distinct !DISubprogram(name: "build_unsigned_int", scope: !12, file: !12, line: 140, type: !169, scopeLine: 140, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !33, retainedNodes: !41)
!169 = !DISubroutineType(types: !170)
!170 = !{!9, !68, !13, !53}
!171 = !DILocalVariable(name: "num", arg: 1, scope: !168, file: !12, line: 140, type: !68)
!172 = !DILocation(line: 140, scope: !168)
!173 = !DILocalVariable(name: "num_size", arg: 2, scope: !168, file: !12, line: 140, type: !13)
!174 = !DILocalVariable(name: "builder", arg: 3, scope: !168, file: !12, line: 140, type: !53)
!175 = !DILocation(line: 141, column: 2, scope: !168)
!176 = !DILocation(line: 146, column: 1, scope: !168)
!177 = !DILocation(line: 142, column: 3, scope: !168)
!178 = !DILocalVariable(name: "digit", scope: !168, file: !12, line: 142, type: !68, align: 64)
!179 = !DILocation(line: 143, column: 21, scope: !168)
!180 = !DILocation(line: 144, column: 4, scope: !168)
!181 = !DILocation(line: 145, column: 2, scope: !168)
!182 = distinct !DISubprogram(name: "int_to_str", scope: !12, file: !12, line: 148, type: !183, scopeLine: 149, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !33, retainedNodes: !41)
!183 = !DISubroutineType(types: !184)
!184 = !{!9, !13, !53}
!185 = !DILocalVariable(name: "num", arg: 1, scope: !182, file: !12, line: 148, type: !13)
!186 = !DILocation(line: 148, scope: !182)
!187 = !DILocalVariable(name: "builder", arg: 2, scope: !182, file: !12, line: 148, type: !53)
!188 = !DILocation(line: 150, column: 2, scope: !182)
!189 = !DILocation(line: 157, column: 2, scope: !182)
!190 = !DILocation(line: 151, column: 4, scope: !182)
!191 = !DILocation(line: 152, column: 5, scope: !182)
!192 = !DILocation(line: 154, column: 2, scope: !182)
!193 = !DILocalVariable(name: "div_copy", scope: !182, file: !12, line: 154, type: !13, align: 64)
!194 = !DILocation(line: 155, column: 2, scope: !182)
!195 = !DILocalVariable(name: "num_size", scope: !182, file: !12, line: 155, type: !13, align: 64)
!196 = !DILocation(line: 158, column: 3, scope: !182)
!197 = !DILocation(line: 159, column: 2, scope: !182)
!198 = !DILocation(line: 160, column: 2, scope: !182)
!199 = !DILocation(line: 166, column: 1, scope: !182)
!200 = !DILocation(line: 161, column: 4, scope: !182)
!201 = !DILocation(line: 162, column: 3, scope: !182)
!202 = !DILocation(line: 163, column: 3, scope: !182)
!203 = !DILocation(line: 164, column: 2, scope: !182)
!204 = !DILocation(line: 165, column: 20, scope: !182)
!205 = distinct !DISubprogram(name: "parse_format", scope: !12, file: !12, line: 168, type: !206, scopeLine: 169, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !33, retainedNodes: !41)
!206 = !DISubroutineType(types: !207)
!207 = !{!9, !57, !208}
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "Any", scope: !2, file: !2, line: 51, size: 128, align: 64, elements: !210)
!210 = !{!211, !266}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !2, file: !2, line: 52, baseType: !212, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Info", scope: !2, file: !2, line: 56, size: 320, align: 64, elements: !214)
!214 = !{!215, !216, !221, !234, !242, !249, !257}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !2, file: !2, line: 57, baseType: !40, size: 32, align: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "primitive", scope: !2, file: !2, line: 66, baseType: !217, size: 64, align: 128)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Primitive", scope: !2, file: !2, line: 66, size: 64, align: 32, elements: !218)
!218 = !{!219, !220}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !2, file: !2, line: 67, baseType: !40, size: 32, align: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2, file: !2, line: 68, baseType: !40, size: 32, align: 32, offset: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !2, file: !2, line: 71, baseType: !222, size: 320, align: 128)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Struct", scope: !2, file: !2, line: 71, size: 320, align: 64, elements: !223)
!223 = !{!224, !225, !226, !227, !228, !229, !231}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !2, file: !2, line: 72, baseType: !40, size: 32, align: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "member_count", scope: !2, file: !2, line: 73, baseType: !40, size: 32, align: 32, offset: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "is_union", scope: !2, file: !2, line: 74, baseType: !3, size: 8, align: 8, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "is_packed", scope: !2, file: !2, line: 75, baseType: !3, size: 8, align: 8, offset: 72)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2, file: !2, line: 76, baseType: !60, size: 64, align: 64, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "member_names", scope: !2, file: !2, line: 77, baseType: !230, size: 64, align: 64, offset: 192)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "member_types", scope: !2, file: !2, line: 78, baseType: !232, size: 64, align: 64, offset: 256)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Info", scope: !2, file: !2, line: 78, size: 320, align: 64, elements: !214)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !2, file: !2, line: 81, baseType: !235, size: 192, align: 128)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Array", scope: !2, file: !2, line: 81, size: 192, align: 64, elements: !236)
!236 = !{!237, !238, !241}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !2, file: !2, line: 82, baseType: !40, size: 32, align: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !2, file: !2, line: 83, baseType: !239, size: 64, align: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Info", scope: !2, file: !2, line: 83, size: 320, align: 64, elements: !214)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "elem_count", scope: !2, file: !2, line: 84, baseType: !68, size: 64, align: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !2, file: !2, line: 87, baseType: !243, size: 128, align: 128)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Pointer", scope: !2, file: !2, line: 87, size: 128, align: 64, elements: !244)
!244 = !{!245, !246}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !2, file: !2, line: 88, baseType: !40, size: 32, align: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "pointed", scope: !2, file: !2, line: 89, baseType: !247, size: 64, align: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Info", scope: !2, file: !2, line: 89, size: 320, align: 64, elements: !214)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "enumerator", scope: !2, file: !2, line: 92, baseType: !250, size: 256, align: 128)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Enum", scope: !2, file: !2, line: 92, size: 256, align: 64, elements: !251)
!251 = !{!252, !253, !254, !255}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !2, file: !2, line: 93, baseType: !40, size: 32, align: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !2, file: !2, line: 94, baseType: !217, size: 64, align: 128, offset: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "names", scope: !2, file: !2, line: 95, baseType: !230, size: 64, align: 64, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !2, file: !2, line: 96, baseType: !256, size: 64, align: 64, offset: 192)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !2, file: !2, line: 99, baseType: !258, size: 256, align: 128)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Func", scope: !2, file: !2, line: 99, size: 256, align: 64, elements: !259)
!259 = !{!260, !261, !264, !265}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !2, file: !2, line: 100, baseType: !40, size: 32, align: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "param_types", scope: !2, file: !2, line: 101, baseType: !262, size: 64, align: 64, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Info", scope: !2, file: !2, line: 101, size: 320, align: 64, elements: !214)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "return_type", scope: !2, file: !2, line: 102, baseType: !262, size: 64, align: 64, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "calling_convention", scope: !2, file: !2, line: 103, baseType: !40, size: 32, align: 32, offset: 192)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !2, file: !2, line: 53, baseType: !8, size: 64, align: 64, offset: 64)
!267 = !DILocalVariable(name: "format", arg: 1, scope: !205, file: !12, line: 168, type: !57)
!268 = !DILocation(line: 168, scope: !205)
!269 = !DILocalVariable(name: "list", arg: 2, scope: !205, file: !12, line: 168, type: !208)
!270 = !DILocation(line: 170, column: 2, scope: !205)
!271 = !DILocalVariable(name: "builder", scope: !205, file: !12, line: 170, type: !44, align: 128)
!272 = !DILocation(line: 171, column: 2, scope: !205)
!273 = !DILocalVariable(name: "list_index", scope: !205, file: !12, line: 171, type: !13, align: 64)
!274 = !DILocation(line: 172, column: 2, scope: !205)
!275 = !DILocalVariable(name: "i", scope: !205, file: !12, line: 172, type: !13, align: 64)
!276 = !DILocation(line: 172, column: 6, scope: !205)
!277 = !DILocation(line: 173, column: 3, scope: !205)
!278 = !DILocation(line: 183, column: 2, scope: !205)
!279 = !DILocation(line: 184, column: 2, scope: !205)
!280 = !DILocation(line: 185, column: 2, scope: !205)
!281 = !DILocalVariable(name: "out", scope: !205, file: !12, line: 185, type: !57, align: 128)
!282 = !DILocation(line: 186, column: 5, scope: !205)
!283 = !DILocation(line: 174, column: 4, scope: !205)
!284 = !DILocalVariable(name: "item", scope: !205, file: !12, line: 174, type: !209, align: 128)
!285 = !DILocation(line: 175, column: 4, scope: !205)
!286 = !DILocation(line: 176, column: 4, scope: !205)
!287 = !DILocalVariable(name: "type", scope: !205, file: !12, line: 176, type: !40, align: 32)
!288 = !DILocation(line: 177, column: 4, scope: !205)
!289 = !DILocation(line: 180, column: 3, scope: !205)
!290 = !DILocation(line: 178, column: 15, scope: !205)
!291 = !DILocation(line: 179, column: 4, scope: !205)
!292 = !DILocation(line: 181, column: 4, scope: !205)
!293 = !DILocation(line: 182, column: 3, scope: !205)
!294 = distinct !DISubprogram(name: "print!@* u8!@-", scope: !12, file: !12, line: 189, type: !108, scopeLine: 190, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !33, retainedNodes: !41)
!295 = !DILocalVariable(name: "format", arg: 1, scope: !294, file: !12, line: 189, type: !60)
!296 = !DILocation(line: 189, scope: !294)
!297 = !DILocation(line: 191, column: 2, scope: !294)
!298 = !DILocalVariable(name: "str", scope: !294, file: !12, line: 191, type: !57, align: 128)
!299 = !DILocation(line: 192, column: 2, scope: !294)
!300 = !DILocalVariable(name: "list", scope: !294, file: !12, line: 192, type: !208, align: 64)
!301 = !DILocation(line: 193, column: 15, scope: !294)
!302 = !DILocation(line: 194, column: 2, scope: !294)
!303 = !DILocalVariable(name: "out", scope: !294, file: !12, line: 194, type: !57, align: 128)
!304 = !DILocation(line: 195, column: 14, scope: !294)
!305 = !DILocation(line: 196, column: 2, scope: !294)
!306 = !DILocalVariable(name: "stdout", scope: !294, file: !12, line: 196, type: !8, align: 64)
!307 = !DILocation(line: 197, column: 12, scope: !294)
!308 = !DILocation(line: 198, column: 1, scope: !294)
!309 = distinct !DISubprogram(name: "print!@string!@-", scope: !12, file: !12, line: 200, type: !157, scopeLine: 201, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !33, retainedNodes: !41)
!310 = !DILocalVariable(name: "format", arg: 1, scope: !309, file: !12, line: 200, type: !57)
!311 = !DILocation(line: 200, scope: !309)
!312 = !DILocation(line: 202, column: 2, scope: !309)
!313 = !DILocalVariable(name: "list", scope: !309, file: !12, line: 202, type: !208, align: 64)
!314 = !DILocation(line: 203, column: 15, scope: !309)
!315 = !DILocation(line: 204, column: 2, scope: !309)
!316 = !DILocalVariable(name: "out", scope: !309, file: !12, line: 204, type: !57, align: 128)
!317 = !DILocation(line: 205, column: 14, scope: !309)
!318 = !DILocation(line: 206, column: 2, scope: !309)
!319 = !DILocalVariable(name: "stdout", scope: !309, file: !12, line: 206, type: !8, align: 64)
!320 = !DILocation(line: 207, column: 12, scope: !309)
