; ModuleID = 'quick_test_2.apoc'
source_filename = "quick_test_2.apoc"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%Type_Info = type { %Type_Struct.1 }
%Type_Struct.1 = type { i32, i32, i8, i8, ptr, ptr, ptr }
%Type_Primitive.2 = type { i32, i32 }
%Any = type { ptr, ptr }
%String_Builder = type { [256 x i8], i64, ptr }
%string = type { ptr, i64 }
%__Internal_Context = type { ptr }

@global_var = local_unnamed_addr global double 5.432100e+04, !dbg !0
@global_var.1 = local_unnamed_addr constant i8 1, !dbg !4
@global_var.2 = local_unnamed_addr constant i8 0, !dbg !8
@global_var.3 = local_unnamed_addr constant ptr null, !dbg !10
@global_var.4 = local_unnamed_addr constant i64 256, !dbg !13
@global_var.5 = local_unnamed_addr constant i64 65536, !dbg !17
@global_var.6 = local_unnamed_addr constant i64 131072, !dbg !20
@global_var.7 = local_unnamed_addr constant i64 262144, !dbg !22
@global_var.8 = local_unnamed_addr constant i64 524288, !dbg !24
@global_var.9 = local_unnamed_addr constant i64 1048576, !dbg !26
@0 = private unnamed_addr constant [30 x i8] c"The var 1 is %\0Aand var 2 is %\00", align 1
@1 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1

; Function Attrs: mustprogress nofree norecurse nosync nounwind readnone willreturn
define i32 @give_num() local_unnamed_addr #0 !dbg !33 {
entry:

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "my_global_var", scope: !2, file: !2, line: 6, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "./Test.apoc", directory: "E:\\C_Projects\\Apocalypse")
!3 = !DIBasicType(name: "f64", size: 64, encoding: DW_ATE_float)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "true", scope: !6, file: !6, line: 2, type: !7, isLocal: true, isDefinition: true)
!6 = !DIFile(filename: "./Basic.apoc", directory: "E:\\C_Projects\\Apocalypse\\Standard")
!7 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!8 = !DIGlobalVariableExpression(var: !9, expr: !DIExpression())
!9 = distinct !DIGlobalVariable(name: "false", scope: !6, file: !6, line: 3, type: !7, isLocal: true, isDefinition: true)
!10 = !DIGlobalVariableExpression(var: !11, expr: !DIExpression())
!11 = distinct !DIGlobalVariable(name: "null", scope: !6, file: !6, line: 4, type: !12, isLocal: true, isDefinition: true)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!13 = !DIGlobalVariableExpression(var: !14, expr: !DIExpression())
!14 = distinct !DIGlobalVariable(name: "STRING_BUFFER_SIZE", scope: !15, file: !15, line: 2, type: !16, isLocal: true, isDefinition: true)
!15 = !DIFile(filename: "./String.apoc", directory: "E:\\C_Projects\\Apocalypse\\Standard")
!16 = !DIBasicType(name: "i64", size: 64, encoding: DW_ATE_signed)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(name: "DELETE", scope: !19, file: !19, line: 58, type: !16, isLocal: true, isDefinition: true)
!19 = !DIFile(filename: "./Windows.apoc", directory: "E:\\C_Projects\\Apocalypse\\Standard")
!20 = !DIGlobalVariableExpression(var: !21, expr: !DIExpression())
!21 = distinct !DIGlobalVariable(name: "READ_CONTROL", scope: !19, file: !19, line: 59, type: !16, isLocal: true, isDefinition: true)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(name: "WRITE_DAC", scope: !19, file: !19, line: 60, type: !16, isLocal: true, isDefinition: true)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "WRITE_OWNER", scope: !19, file: !19, line: 61, type: !16, isLocal: true, isDefinition: true)
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "SYNCHRONIZE", scope: !19, file: !19, line: 62, type: !16, isLocal: true, isDefinition: true)
!28 = distinct !DICompileUnit(language: DW_LANG_C99, file: !29, producer: "Apoc Compiler", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !30)
!29 = !DIFile(filename: "quick_test_2.apoc", directory: "E:\\C_Projects\\Apocalypse")
!30 = !{!0, !4, !8, !10, !13, !17, !20, !22, !24, !26}
!31 = !{i32 2, !"Debug Info Version", i32 3}
!32 = !{i32 2, !"CodeView", i32 1}
!33 = distinct !DISubprogram(name: "give_num", scope: !29, file: !29, line: 2, type: !34, scopeLine: 2, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !37)
!34 = !DISubroutineType(types: !35)
!35 = !{!36}
!36 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!37 = !{}
!38 = !DILocalVariable(name: "a", scope: !33, file: !29, line: 3, type: !36, align: 32)
!39 = !DILocation(line: 0, scope: !33)
!40 = !DILocation(line: 4, column: 5, scope: !33)
!41 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 8, type: !34, scopeLine: 9, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !37)
!42 = !DILocalVariable(name: "var_one", scope: !41, file: !2, line: 10, type: !43, align: 32)
!43 = !DIBasicType(name: "f32", size: 32, encoding: DW_ATE_float)
!44 = !DILocation(line: 0, scope: !41)
!45 = !DILocalVariable(name: "var_two", scope: !41, file: !2, line: 11, type: !3, align: 64)
!46 = !DILocation(line: 13, column: 3, scope: !41)
!47 = !DILocalVariable(name: "b", scope: !41, file: !2, line: 14, type: !3, align: 64)
!48 = !DILocation(line: 15, column: 7, scope: !41)
!49 = !DILocation(line: 16, column: 5, scope: !41)
!50 = distinct !DISubprogram(name: "mem_alloc", scope: !51, file: !51, line: 12, type: !52, scopeLine: 13, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !37)
!51 = !DIFile(filename: "./C_Standard.apoc", directory: "E:\\C_Projects\\Apocalypse\\Standard")
!52 = !DISubroutineType(types: !53)
!53 = !{!12, !54}
!54 = !DIBasicType(name: "u64", size: 32, encoding: DW_ATE_unsigned)
!55 = !DILocalVariable(name: "size", arg: 1, scope: !50, file: !51, line: 12, type: !54)
!56 = !DILocation(line: 0, scope: !50)
!57 = !DILocation(line: 14, column: 2, scope: !50)
!58 = !DILocalVariable(name: "result", scope: !50, file: !51, line: 14, type: !12, align: 64)
!59 = !DILocation(line: 15, column: 8, scope: !50)
!60 = !DILocation(line: 16, column: 5, scope: !50)
!61 = distinct !DISubprogram(name: "builder_to_string", scope: !15, file: !15, line: 17, type: !62, scopeLine: 18, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !37)
!62 = !DISubroutineType(types: !63)
!63 = !{null, !64}
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "String_Builder", scope: !15, file: !15, line: 10, size: 2176, align: 2048, elements: !66)
!66 = !{!67, !72, !73}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !15, file: !15, line: 12, baseType: !68, size: 2048, align: 8)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 2048, align: 8, elements: !70)
!69 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!70 = !{!71}
!71 = !DISubrange(count: 256, lowerBound: 0)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !15, file: !15, line: 13, baseType: !16, size: 64, align: 64, offset: 2048)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !15, file: !15, line: 14, baseType: !64, size: 64, align: 64, offset: 2112)
!74 = !DILocalVariable(name: "builder", arg: 1, scope: !61, file: !15, line: 17, type: !64)
!75 = !DILocation(line: 0, scope: !61)
!76 = !DILocalVariable(name: "out", scope: !61, file: !15, line: 19, type: !77, align: 64)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", scope: !15, file: !15, line: 4, size: 128, align: 64, elements: !78)
!78 = !{!79, !81}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !15, file: !15, line: 6, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !15, file: !15, line: 7, baseType: !16, size: 64, align: 64, offset: 64)
!82 = !DILocalVariable(name: "out_len", scope: !61, file: !15, line: 20, type: !16, align: 64)
!83 = !DILocalVariable(name: "current", scope: !61, file: !15, line: 21, type: !64, align: 64)
!84 = !DILocalVariable(name: "i", scope: !61, file: !15, line: 22, type: !16, align: 64)
!85 = !DILocation(line: 22, column: 2, scope: !61)
!86 = !DILocation(line: 23, column: 3, scope: !61)
!87 = !DILocation(line: 26, column: 2, scope: !61)
!88 = !DILocation(line: 0, scope: !50, inlinedAt: !89)
!89 = distinct !DILocation(line: 27, column: 2, scope: !61)
!90 = !DILocation(line: 14, column: 2, scope: !50, inlinedAt: !89)
!91 = !DILocation(line: 15, column: 8, scope: !50, inlinedAt: !89)
!92 = !DILocalVariable(name: "times", scope: !61, file: !15, line: 30, type: !16, align: 64)
!93 = !DILocalVariable(name: "i", scope: !61, file: !15, line: 31, type: !16, align: 64)
!94 = !DILocation(line: 31, column: 2, scope: !61)
!95 = !DILocation(line: 265, column: 2, scope: !96, inlinedAt: !99)
!96 = distinct !DISubprogram(name: "copy", scope: !15, file: !15, line: 261, type: !97, scopeLine: 262, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !37)
!97 = !DISubroutineType(types: !98)
!98 = !{null, !12, !12, !54}
!99 = distinct !DILocation(line: 32, column: 7, scope: !61)
!100 = !DILocation(line: 32, column: 7, scope: !61)
!101 = !DILocalVariable(name: "dst", arg: 1, scope: !96, file: !15, line: 261, type: !12)
!102 = !DILocation(line: 0, scope: !96, inlinedAt: !99)
!103 = !DILocalVariable(name: "src", arg: 2, scope: !96, file: !15, line: 261, type: !12)
!104 = !DILocalVariable(name: "size", arg: 3, scope: !96, file: !15, line: 261, type: !54)
!105 = !DILocalVariable(name: "a0", scope: !96, file: !15, line: 263, type: !80, align: 64)
!106 = !DILocalVariable(name: "a1", scope: !96, file: !15, line: 264, type: !80, align: 64)
!107 = !DILocalVariable(name: "i", scope: !96, file: !15, line: 265, type: !16, align: 64)
!108 = !DILocation(line: 267, column: 3, scope: !96, inlinedAt: !99)
!109 = distinct !{!109, !110}
!110 = !{!"llvm.loop.isvectorized", i32 1}
!111 = distinct !{!111, !110}
!112 = !DILocation(line: 33, column: 3, scope: !61)
!113 = !DILocation(line: 34, column: 3, scope: !61)
!114 = !DILocation(line: 36, column: 6, scope: !61)
!115 = !DILocation(line: 0, scope: !96, inlinedAt: !116)
!116 = distinct !DILocation(line: 36, column: 6, scope: !61)
!117 = !DILocation(line: 265, column: 2, scope: !96, inlinedAt: !116)
!118 = !DILocation(line: 267, column: 3, scope: !96, inlinedAt: !116)
!119 = distinct !{!119, !110}
!120 = distinct !{!120, !110}
!121 = !DILocation(line: 38, column: 5, scope: !61)
!122 = distinct !DISubprogram(name: "init_builder", scope: !15, file: !15, line: 41, type: !123, scopeLine: 42, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !37)
!123 = !DISubroutineType(types: !124)
!124 = !{null, !80}
!125 = !DILocalVariable(name: "text", arg: 1, scope: !122, file: !15, line: 41, type: !80)
!126 = !DILocation(line: 0, scope: !122)
!127 = !DILocation(line: 43, column: 2, scope: !122)
!128 = !DILocalVariable(name: "out", scope: !122, file: !15, line: 43, type: !65, align: 2048)
!129 = !DILocalVariable(name: "current", scope: !122, file: !15, line: 44, type: !64, align: 64)
!130 = !DILocalVariable(name: "times", scope: !122, file: !15, line: 45, type: !16, align: 64)
!131 = !DILocalVariable(name: "i", scope: !122, file: !15, line: 46, type: !16, align: 64)
!132 = !DILocation(line: 46, column: 2, scope: !122)
!133 = !DILocation(line: 53, column: 4, scope: !122)
!134 = !DILocation(line: 47, column: 3, scope: !122)
!135 = !DILocation(line: 48, column: 3, scope: !122)
!136 = !DILocation(line: 49, column: 3, scope: !122)
!137 = !DILocation(line: 44, column: 2, scope: !122)
!138 = !DILocation(line: 56, column: 5, scope: !122)
!139 = !DILocation(line: 51, column: 4, scope: !122)
!140 = !DILocation(line: 0, scope: !50, inlinedAt: !141)
!141 = distinct !DILocation(line: 52, column: 4, scope: !122)
!142 = !DILocation(line: 14, column: 2, scope: !50, inlinedAt: !141)
!143 = !DILocation(line: 15, column: 8, scope: !50, inlinedAt: !141)
!144 = !DILocation(line: 52, column: 4, scope: !122)
!145 = distinct !DISubprogram(name: "compare", scope: !15, file: !15, line: 111, type: !146, scopeLine: 112, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !37)
!146 = !DISubroutineType(types: !147)
!147 = !{!7, !77, !77}
!148 = !DILocalVariable(name: "str1", arg: 1, scope: !145, file: !15, line: 111, type: !77)
!149 = !DILocation(line: 0, scope: !145)
!150 = !DILocalVariable(name: "str2", arg: 2, scope: !145, file: !15, line: 111, type: !77)
!151 = !DILocation(line: 113, column: 2, scope: !145)
!152 = !DILocation(line: 116, column: 2, scope: !145)
!153 = !DILocalVariable(name: "i", scope: !145, file: !15, line: 116, type: !16, align: 64)
!154 = !DILocation(line: 117, column: 38, scope: !145)
!155 = !DILocation(line: 117, column: 3, scope: !145)
!156 = distinct !DISubprogram(name: "to_string", scope: !15, file: !15, line: 121, type: !123, scopeLine: 122, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !37)
!157 = !DILocalVariable(name: "text", arg: 1, scope: !156, file: !15, line: 121, type: !80)
!158 = !DILocation(line: 0, scope: !156)
!159 = !DILocalVariable(name: "text", arg: 1, scope: !160, file: !15, line: 271, type: !80)
!160 = distinct !DISubprogram(name: "len", scope: !15, file: !15, line: 271, type: !161, scopeLine: 272, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !37)
!161 = !DISubroutineType(types: !162)
!162 = !{!16, !80}
!163 = !DILocation(line: 0, scope: !160, inlinedAt: !164)
!164 = distinct !DILocation(line: 123, column: 2, scope: !156)
!165 = !DILocalVariable(name: "result", scope: !160, file: !15, line: 273, type: !16, align: 64)
!166 = !DILocation(line: 274, column: 2, scope: !160, inlinedAt: !164)
!167 = !DILocalVariable(name: "text_len", scope: !156, file: !15, line: 123, type: !16, align: 64)
!168 = !DILocation(line: 0, scope: !50, inlinedAt: !169)
!169 = distinct !DILocation(line: 124, column: 2, scope: !156)
!170 = !DILocation(line: 14, column: 2, scope: !50, inlinedAt: !169)
!171 = !DILocation(line: 15, column: 8, scope: !50, inlinedAt: !169)
!172 = !DILocalVariable(name: "allocated", scope: !156, file: !15, line: 124, type: !12, align: 64)
!173 = !DILocation(line: 0, scope: !96, inlinedAt: !174)
!174 = distinct !DILocation(line: 125, column: 6, scope: !156)
!175 = !DILocation(line: 265, column: 2, scope: !96, inlinedAt: !174)
!176 = !DILocation(line: 267, column: 3, scope: !96, inlinedAt: !174)
!177 = !DILocation(line: 127, column: 5, scope: !156)
!178 = !DILocalVariable(name: "str", scope: !156, file: !15, line: 126, type: !77, align: 64)
!179 = distinct !DISubprogram(name: "terminate_string", scope: !15, file: !15, line: 130, type: !180, scopeLine: 131, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !37)
!180 = !DISubroutineType(types: !181)
!181 = !{null, !77}
!182 = !DILocalVariable(name: "str", arg: 1, scope: !179, file: !15, line: 130, type: !77)
!183 = !DILocation(line: 0, scope: !179)
!184 = !DILocalVariable(name: "out", scope: !179, file: !15, line: 132, type: !77, align: 64)
!185 = !DILocation(line: 133, column: 2, scope: !179)
!186 = !DILocation(line: 0, scope: !50, inlinedAt: !187)
!187 = distinct !DILocation(line: 134, column: 2, scope: !179)
!188 = !DILocation(line: 14, column: 2, scope: !50, inlinedAt: !187)
!189 = !DILocation(line: 15, column: 8, scope: !50, inlinedAt: !187)
!190 = !DILocation(line: 0, scope: !96, inlinedAt: !191)
!191 = distinct !DILocation(line: 135, column: 6, scope: !179)
!192 = !DILocation(line: 265, column: 2, scope: !96, inlinedAt: !191)
!193 = !DILocation(line: 267, column: 3, scope: !96, inlinedAt: !191)
!194 = distinct !{!194, !110}
!195 = distinct !{!195, !110}
!196 = !DILocation(line: 136, column: 2, scope: !179)
!197 = !DILocation(line: 137, column: 5, scope: !179)
!198 = distinct !DISubprogram(name: "build_unsigned_int", scope: !15, file: !15, line: 140, type: !199, scopeLine: 140, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !37)
!199 = !DISubroutineType(types: !200)
!200 = !{null, !54, !16, !64}
!201 = !DILocalVariable(name: "num", arg: 1, scope: !198, file: !15, line: 140, type: !54)
!202 = !DILocation(line: 0, scope: !198)
!203 = !DILocalVariable(name: "num_size", arg: 2, scope: !198, file: !15, line: 140, type: !16)
!204 = !DILocalVariable(name: "builder", arg: 3, scope: !198, file: !15, line: 140, type: !64)
!205 = !DILocation(line: 141, column: 2, scope: !198)
!206 = !DILocation(line: 146, column: 1, scope: !198)
!207 = !DILocation(line: 143, column: 21, scope: !198)
!208 = !DILocalVariable(name: "digit", scope: !198, file: !15, line: 142, type: !54, align: 64)
!209 = !DILocation(line: 144, column: 4, scope: !198)
!210 = !DILocalVariable(name: "str", scope: !211, file: !15, line: 91, type: !64)
!211 = distinct !DISubprogram(name: "overload[x]=", scope: !15, file: !15, line: 91, type: !212, scopeLine: 92, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !37)
!212 = !DISubroutineType(types: !213)
!213 = !{null, !64, !69}
!214 = !DILocation(line: 0, scope: !211, inlinedAt: !215)
!215 = distinct !DILocation(line: 144, column: 4, scope: !198)
!216 = !DILocalVariable(name: "c", arg: 1, scope: !211, file: !15, line: 91, type: !69)
!217 = !DILocalVariable(name: "to_put", scope: !211, file: !15, line: 93, type: !64, align: 64)
!218 = !DILocation(line: 94, column: 2, scope: !211, inlinedAt: !215)
!219 = !DILocation(line: 99, column: 4, scope: !211, inlinedAt: !215)
!220 = !DILocation(line: 95, column: 3, scope: !211, inlinedAt: !215)
!221 = !DILocation(line: 0, scope: !50, inlinedAt: !222)
!222 = distinct !DILocation(line: 96, column: 4, scope: !211, inlinedAt: !215)
!223 = !DILocation(line: 14, column: 2, scope: !50, inlinedAt: !222)
!224 = !DILocation(line: 15, column: 8, scope: !50, inlinedAt: !222)
!225 = !DILocation(line: 96, column: 4, scope: !211, inlinedAt: !215)
!226 = !DILocation(line: 98, column: 3, scope: !211, inlinedAt: !215)
!227 = !DILocation(line: 101, column: 2, scope: !211, inlinedAt: !215)
!228 = !DILocation(line: 102, column: 2, scope: !211, inlinedAt: !215)
!229 = distinct !DISubprogram(name: "int_to_str", scope: !15, file: !15, line: 148, type: !230, scopeLine: 149, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !37)
!230 = !DISubroutineType(types: !231)
!231 = !{null, !16, !64}
!232 = !DILocalVariable(name: "num", arg: 1, scope: !229, file: !15, line: 148, type: !16)
!233 = !DILocation(line: 0, scope: !229)
!234 = !DILocalVariable(name: "builder", arg: 2, scope: !229, file: !15, line: 148, type: !64)
!235 = !DILocation(line: 150, column: 2, scope: !229)
!236 = !DILocation(line: 157, column: 2, scope: !229)
!237 = !DILocation(line: 0, scope: !211, inlinedAt: !238)
!238 = distinct !DILocation(line: 151, column: 4, scope: !229)
!239 = !DILocation(line: 94, column: 2, scope: !211, inlinedAt: !238)
!240 = !DILocation(line: 99, column: 4, scope: !211, inlinedAt: !238)
!241 = !DILocation(line: 95, column: 3, scope: !211, inlinedAt: !238)
!242 = !DILocation(line: 0, scope: !50, inlinedAt: !243)
!243 = distinct !DILocation(line: 96, column: 4, scope: !211, inlinedAt: !238)
!244 = !DILocation(line: 14, column: 2, scope: !50, inlinedAt: !243)
!245 = !DILocation(line: 15, column: 8, scope: !50, inlinedAt: !243)
!246 = !DILocation(line: 96, column: 4, scope: !211, inlinedAt: !238)
!247 = !DILocation(line: 98, column: 3, scope: !211, inlinedAt: !238)
!248 = !DILocation(line: 101, column: 2, scope: !211, inlinedAt: !238)
!249 = !DILocation(line: 102, column: 2, scope: !211, inlinedAt: !238)
!250 = !DILocalVariable(name: "num_size", scope: !229, file: !15, line: 155, type: !16, align: 64)
!251 = !DILocalVariable(name: "div_copy", scope: !229, file: !15, line: 154, type: !16, align: 64)
!252 = !DILocation(line: 158, column: 3, scope: !229)
!253 = !DILocation(line: 160, column: 2, scope: !229)
!254 = !DILocation(line: 166, column: 1, scope: !229)
!255 = !DILocation(line: 0, scope: !211, inlinedAt: !256)
!256 = distinct !DILocation(line: 161, column: 4, scope: !229)
!257 = !DILocation(line: 94, column: 2, scope: !211, inlinedAt: !256)
!258 = !DILocation(line: 99, column: 4, scope: !211, inlinedAt: !256)
!259 = !DILocation(line: 95, column: 3, scope: !211, inlinedAt: !256)
!260 = !DILocation(line: 0, scope: !50, inlinedAt: !261)
!261 = distinct !DILocation(line: 96, column: 4, scope: !211, inlinedAt: !256)
!262 = !DILocation(line: 14, column: 2, scope: !50, inlinedAt: !261)
!263 = !DILocation(line: 15, column: 8, scope: !50, inlinedAt: !261)
!264 = !DILocation(line: 96, column: 4, scope: !211, inlinedAt: !256)
!265 = !DILocation(line: 98, column: 3, scope: !211, inlinedAt: !256)
!266 = !DILocation(line: 101, column: 2, scope: !211, inlinedAt: !256)
!267 = !DILocation(line: 102, column: 2, scope: !211, inlinedAt: !256)
!268 = !DILocation(line: 162, column: 3, scope: !229)
!269 = !DILocation(line: 163, column: 3, scope: !229)
!270 = !DILocation(line: 165, column: 20, scope: !229)
!271 = distinct !DISubprogram(name: "float_to_str", scope: !15, file: !15, line: 168, type: !272, scopeLine: 169, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !37)
!272 = !DISubroutineType(types: !273)
!273 = !{null, !3, !64}
!274 = !DILocalVariable(name: "num", arg: 1, scope: !271, file: !15, line: 168, type: !3)
!275 = !DILocation(line: 0, scope: !271)
!276 = !DILocalVariable(name: "builder", arg: 2, scope: !271, file: !15, line: 168, type: !64)
!277 = !DILocation(line: 170, column: 2, scope: !271)
!278 = !DILocation(line: 185, column: 2, scope: !271)
!279 = !DILocation(line: 0, scope: !211, inlinedAt: !280)
!280 = distinct !DILocation(line: 171, column: 4, scope: !271)
!281 = !DILocation(line: 94, column: 2, scope: !211, inlinedAt: !280)
!282 = !DILocation(line: 99, column: 4, scope: !211, inlinedAt: !280)
!283 = !DILocation(line: 95, column: 3, scope: !211, inlinedAt: !280)
!284 = !DILocation(line: 0, scope: !50, inlinedAt: !285)
!285 = distinct !DILocation(line: 96, column: 4, scope: !211, inlinedAt: !280)
!286 = !DILocation(line: 14, column: 2, scope: !50, inlinedAt: !285)
!287 = !DILocation(line: 15, column: 8, scope: !50, inlinedAt: !285)
!288 = !DILocation(line: 96, column: 4, scope: !211, inlinedAt: !280)
!289 = !DILocation(line: 98, column: 3, scope: !211, inlinedAt: !280)
!290 = !DILocation(line: 101, column: 2, scope: !211, inlinedAt: !280)
!291 = !DILocation(line: 102, column: 2, scope: !211, inlinedAt: !280)
!292 = !DILocation(line: 172, column: 3, scope: !271)
!293 = !DILocation(line: 175, column: 2, scope: !271)
!294 = !DILocalVariable(name: "decimal", scope: !271, file: !15, line: 175, type: !54, align: 64)
!295 = !DILocation(line: 176, column: 2, scope: !271)
!296 = !DILocation(line: 178, column: 2, scope: !271)
!297 = !DILocation(line: 0, scope: !211, inlinedAt: !298)
!298 = distinct !DILocation(line: 179, column: 4, scope: !271)
!299 = !DILocation(line: 94, column: 2, scope: !211, inlinedAt: !298)
!300 = !DILocation(line: 99, column: 4, scope: !211, inlinedAt: !298)
!301 = !DILocation(line: 95, column: 3, scope: !211, inlinedAt: !298)
!302 = !DILocation(line: 0, scope: !50, inlinedAt: !303)
!303 = distinct !DILocation(line: 96, column: 4, scope: !211, inlinedAt: !298)
!304 = !DILocation(line: 14, column: 2, scope: !50, inlinedAt: !303)
!305 = !DILocation(line: 15, column: 8, scope: !50, inlinedAt: !303)
!306 = !DILocation(line: 96, column: 4, scope: !211, inlinedAt: !298)
!307 = !DILocation(line: 98, column: 3, scope: !211, inlinedAt: !298)
!308 = !DILocation(line: 101, column: 2, scope: !211, inlinedAt: !298)
!309 = !DILocation(line: 102, column: 2, scope: !211, inlinedAt: !298)
!310 = !DILocation(line: 179, column: 4, scope: !271)
!311 = !DILocation(line: 0, scope: !211, inlinedAt: !312)
!312 = distinct !DILocation(line: 182, column: 3, scope: !271)
!313 = !DILocation(line: 94, column: 2, scope: !211, inlinedAt: !312)
!314 = !DILocation(line: 99, column: 4, scope: !211, inlinedAt: !312)
!315 = !DILocation(line: 95, column: 3, scope: !211, inlinedAt: !312)
!316 = !DILocation(line: 0, scope: !50, inlinedAt: !317)
!317 = distinct !DILocation(line: 96, column: 4, scope: !211, inlinedAt: !312)
!318 = !DILocation(line: 14, column: 2, scope: !50, inlinedAt: !317)
!319 = !DILocation(line: 15, column: 8, scope: !50, inlinedAt: !317)
!320 = !DILocation(line: 96, column: 4, scope: !211, inlinedAt: !312)
!321 = !DILocation(line: 98, column: 3, scope: !211, inlinedAt: !312)
!322 = !DILocation(line: 101, column: 2, scope: !211, inlinedAt: !312)
!323 = !DILocation(line: 102, column: 2, scope: !211, inlinedAt: !312)
!324 = !DILocalVariable(name: "zeroes_to_append", scope: !271, file: !15, line: 183, type: !16, align: 64)
!325 = !DILocation(line: 181, column: 17, scope: !271)
!326 = !DILocalVariable(name: "i", scope: !271, file: !15, line: 190, type: !16, align: 64)
!327 = !DILocation(line: 190, column: 2, scope: !271)
!328 = !DILocation(line: 94, column: 2, scope: !211, inlinedAt: !329)
!329 = distinct !DILocation(line: 191, column: 4, scope: !271)
!330 = !DILocation(line: 186, column: 3, scope: !271)
!331 = !DILocation(line: 187, column: 3, scope: !271)
!332 = !DILocation(line: 187, column: 20, scope: !271)
!333 = !DILocation(line: 0, scope: !211, inlinedAt: !329)
!334 = !DILocation(line: 99, column: 4, scope: !211, inlinedAt: !329)
!335 = !DILocation(line: 95, column: 3, scope: !211, inlinedAt: !329)
!336 = !DILocation(line: 0, scope: !50, inlinedAt: !337)
!337 = distinct !DILocation(line: 96, column: 4, scope: !211, inlinedAt: !329)
!338 = !DILocation(line: 14, column: 2, scope: !50, inlinedAt: !337)
!339 = !DILocation(line: 15, column: 8, scope: !50, inlinedAt: !337)
!340 = !DILocation(line: 96, column: 4, scope: !211, inlinedAt: !329)
!341 = !DILocation(line: 98, column: 3, scope: !211, inlinedAt: !329)
!342 = !DILocation(line: 101, column: 2, scope: !211, inlinedAt: !329)
!343 = !DILocation(line: 102, column: 2, scope: !211, inlinedAt: !329)
!344 = !DILocation(line: 191, column: 4, scope: !271)
!345 = !DILocation(line: 194, column: 12, scope: !271)
!346 = !DILocation(line: 195, column: 1, scope: !271)
!347 = distinct !DISubprogram(name: "parse_format", scope: !15, file: !15, line: 197, type: !348, scopeLine: 198, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !37)
!348 = !DISubroutineType(types: !349)
!349 = !{null, !77, !350}
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DICompositeType(tag: DW_TAG_structure_type, name: "Any", scope: !6, file: !6, line: 51, size: 128, align: 64, elements: !352)
!352 = !{!353, !408}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !6, file: !6, line: 52, baseType: !354, size: 64, align: 64)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Info", scope: !6, file: !6, line: 56, size: 320, align: 64, elements: !356)
!356 = !{!357, !358, !363, !376, !384, !391, !399}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !6, file: !6, line: 57, baseType: !36, size: 32, align: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "primitive", scope: !6, file: !6, line: 66, baseType: !359, size: 64, align: 32)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Primitive", scope: !6, file: !6, line: 66, size: 64, align: 32, elements: !360)
!360 = !{!361, !362}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !6, file: !6, line: 67, baseType: !36, size: 32, align: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !6, file: !6, line: 68, baseType: !36, size: 32, align: 32, offset: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !6, file: !6, line: 71, baseType: !364, size: 320, align: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Struct", scope: !6, file: !6, line: 71, size: 320, align: 64, elements: !365)
!365 = !{!366, !367, !368, !369, !370, !371, !373}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !6, file: !6, line: 72, baseType: !36, size: 32, align: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "member_count", scope: !6, file: !6, line: 73, baseType: !36, size: 32, align: 32, offset: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "is_union", scope: !6, file: !6, line: 74, baseType: !7, size: 8, align: 8, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "is_packed", scope: !6, file: !6, line: 75, baseType: !7, size: 8, align: 8, offset: 72)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !6, file: !6, line: 76, baseType: !80, size: 64, align: 64, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "member_names", scope: !6, file: !6, line: 77, baseType: !372, size: 64, align: 64, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "member_types", scope: !6, file: !6, line: 78, baseType: !374, size: 64, align: 64, offset: 256)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Info", scope: !6, file: !6, line: 78, size: 320, align: 64, elements: !356)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !6, file: !6, line: 81, baseType: !377, size: 192, align: 64)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Array", scope: !6, file: !6, line: 81, size: 192, align: 64, elements: !378)
!378 = !{!379, !380, !383}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !6, file: !6, line: 82, baseType: !36, size: 32, align: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !6, file: !6, line: 83, baseType: !381, size: 64, align: 64, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Info", scope: !6, file: !6, line: 83, size: 320, align: 64, elements: !356)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "elem_count", scope: !6, file: !6, line: 84, baseType: !54, size: 64, align: 64, offset: 128)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !6, file: !6, line: 87, baseType: !385, size: 128, align: 64)
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Pointer", scope: !6, file: !6, line: 87, size: 128, align: 64, elements: !386)
!386 = !{!387, !388}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !6, file: !6, line: 88, baseType: !36, size: 32, align: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "pointed", scope: !6, file: !6, line: 89, baseType: !389, size: 64, align: 64, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Info", scope: !6, file: !6, line: 89, size: 320, align: 64, elements: !356)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "enumerator", scope: !6, file: !6, line: 92, baseType: !392, size: 256, align: 64)
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Enum", scope: !6, file: !6, line: 92, size: 256, align: 64, elements: !393)
!393 = !{!394, !395, !396, !397}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !6, file: !6, line: 93, baseType: !36, size: 32, align: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !6, file: !6, line: 94, baseType: !359, size: 64, align: 32, offset: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "names", scope: !6, file: !6, line: 95, baseType: !372, size: 64, align: 64, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !6, file: !6, line: 96, baseType: !398, size: 64, align: 64, offset: 192)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !6, file: !6, line: 99, baseType: !400, size: 256, align: 64)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Func", scope: !6, file: !6, line: 99, size: 256, align: 64, elements: !401)
!401 = !{!402, !403, !406, !407}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !6, file: !6, line: 100, baseType: !36, size: 32, align: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "param_types", scope: !6, file: !6, line: 101, baseType: !404, size: 64, align: 64, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "Type_Info", scope: !6, file: !6, line: 101, size: 320, align: 64, elements: !356)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "return_type", scope: !6, file: !6, line: 102, baseType: !404, size: 64, align: 64, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "calling_convention", scope: !6, file: !6, line: 103, baseType: !36, size: 32, align: 32, offset: 192)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !6, file: !6, line: 53, baseType: !12, size: 64, align: 64, offset: 64)
!409 = !DILocalVariable(name: "format", arg: 1, scope: !347, file: !15, line: 197, type: !77)
!410 = !DILocation(line: 0, scope: !347)
!411 = !DILocalVariable(name: "list", arg: 2, scope: !347, file: !15, line: 197, type: !350)
!412 = !DILocation(line: 199, column: 2, scope: !347)
!413 = !DILocalVariable(name: "builder", scope: !347, file: !15, line: 199, type: !65, align: 2048)
!414 = !DILocalVariable(name: "list_index", scope: !347, file: !15, line: 200, type: !16, align: 64)
!415 = !DILocalVariable(name: "i", scope: !347, file: !15, line: 201, type: !16, align: 64)
!416 = !DILocalVariable(name: "item", scope: !347, file: !15, line: 203, type: !351, align: 64)
!417 = !DILocation(line: 201, column: 2, scope: !347)
!418 = !DILocalVariable(name: "str", scope: !419, file: !15, line: 59, type: !77)
!419 = distinct !DISubprogram(name: "overload[]", scope: !15, file: !15, line: 59, type: !420, scopeLine: 60, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !37)
!420 = !DISubroutineType(types: !421)
!421 = !{!69, !77, !16}
!422 = !DILocation(line: 0, scope: !419, inlinedAt: !423)
!423 = distinct !DILocation(line: 202, column: 3, scope: !347)
!424 = !DILocalVariable(name: "index", arg: 1, scope: !419, file: !15, line: 59, type: !16)
!425 = !DILocation(line: 61, column: 5, scope: !419, inlinedAt: !423)
!426 = !DILocation(line: 202, column: 3, scope: !347)
!427 = !DILocation(line: 231, column: 4, scope: !347)
!428 = !DILocation(line: 0, scope: !211, inlinedAt: !429)
!429 = distinct !DILocation(line: 234, column: 2, scope: !347)
!430 = !DILocation(line: 94, column: 2, scope: !211, inlinedAt: !429)
!431 = !DILocation(line: 99, column: 4, scope: !211, inlinedAt: !429)
!432 = !DILocation(line: 95, column: 3, scope: !211, inlinedAt: !429)
!433 = !DILocation(line: 0, scope: !50, inlinedAt: !434)
!434 = distinct !DILocation(line: 96, column: 4, scope: !211, inlinedAt: !429)
!435 = !DILocation(line: 14, column: 2, scope: !50, inlinedAt: !434)
!436 = !DILocation(line: 15, column: 8, scope: !50, inlinedAt: !434)
!437 = !DILocation(line: 96, column: 4, scope: !211, inlinedAt: !429)
!438 = !DILocation(line: 98, column: 3, scope: !211, inlinedAt: !429)
!439 = !DILocation(line: 101, column: 2, scope: !211, inlinedAt: !429)
!440 = !DILocation(line: 102, column: 2, scope: !211, inlinedAt: !429)
!441 = !DILocalVariable(name: "out", scope: !347, file: !15, line: 235, type: !77, align: 64)
!442 = !DILocation(line: 0, scope: !61, inlinedAt: !443)
!443 = distinct !DILocation(line: 235, column: 2, scope: !347)
!444 = !DILocation(line: 22, column: 2, scope: !61, inlinedAt: !443)
!445 = !DILocation(line: 23, column: 3, scope: !61, inlinedAt: !443)
!446 = !DILocation(line: 26, column: 2, scope: !61, inlinedAt: !443)
!447 = !DILocation(line: 0, scope: !50, inlinedAt: !448)
!448 = distinct !DILocation(line: 27, column: 2, scope: !61, inlinedAt: !443)
!449 = !DILocation(line: 14, column: 2, scope: !50, inlinedAt: !448)
!450 = !DILocation(line: 15, column: 8, scope: !50, inlinedAt: !448)
!451 = !DILocation(line: 31, column: 2, scope: !61, inlinedAt: !443)
!452 = !DILocation(line: 265, column: 2, scope: !96, inlinedAt: !453)
!453 = distinct !DILocation(line: 32, column: 7, scope: !61, inlinedAt: !443)
!454 = !DILocation(line: 32, column: 7, scope: !61, inlinedAt: !443)
!455 = !DILocation(line: 0, scope: !96, inlinedAt: !453)
!456 = !DILocation(line: 267, column: 3, scope: !96, inlinedAt: !453)
!457 = distinct !{!457, !110}
!458 = distinct !{!458, !110}
!459 = !DILocation(line: 33, column: 3, scope: !61, inlinedAt: !443)
!460 = !DILocation(line: 34, column: 3, scope: !61, inlinedAt: !443)
!461 = !DILocation(line: 36, column: 6, scope: !61, inlinedAt: !443)
!462 = !DILocation(line: 0, scope: !96, inlinedAt: !463)
!463 = distinct !DILocation(line: 36, column: 6, scope: !61, inlinedAt: !443)
